#pragma once

// Antichamber (1.0.7977.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class GameFramework.DynamicSpriteComponent
// 0x0040 (0x0234 - 0x01F4)
class UDynamicSpriteComponent : public USpriteComponent
{
public:
	struct FInterpCurveFloat                           AnimatedScale;                                            // 0x01F4(0x0010) (Edit, NeedCtorLink)
	struct FInterpCurveLinearColor                     AnimatedColor;                                            // 0x0204(0x0010) (Edit, NeedCtorLink)
	struct FInterpCurveVector2D                        AnimatedPosition;                                         // 0x0214(0x0010) (Edit, NeedCtorLink)
	struct FVector                                     LocationOffset;                                           // 0x0224(0x000C) (Edit)
	int                                                LoopCount;                                                // 0x0230(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.DynamicSpriteComponent");
		return ptr;
	}

};


// Class GameFramework.FrameworkGame
// 0x000C (0x037C - 0x0370)
class AFrameworkGame : public AGameInfo
{
public:
	TArray<struct FRequiredMobileInputConfig>          RequiredMobileInputConfigs;                               // 0x0370(0x000C) (Config, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.FrameworkGame");
		return ptr;
	}

};


// Class GameFramework.GameTypes
// 0x0000 (0x003C - 0x003C)
class UGameTypes : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameTypes");
		return ptr;
	}

};


// Class GameFramework.GameAIController
// 0x006C (0x0400 - 0x0394)
class AGameAIController : public AAIController
{
public:
	class UAITree*                                     AITree;                                                   // 0x0394(0x0004) (Edit, Const)
	struct FAITreeHandle                               AITreeHandle;                                             // 0x0398(0x0030) (Edit, NeedCtorLink)
	unsigned long                                      bUseAITree : 1;                                           // 0x03C8(0x0004) (Edit, Config)
	unsigned long                                      bHasRunawayCommandList : 1;                               // 0x03C8(0x0004) (Transient)
	unsigned long                                      bAILogging : 1;                                           // 0x03C8(0x0004) (Edit, Config)
	unsigned long                                      bAILogToWindow : 1;                                       // 0x03C8(0x0004) (Edit, Config)
	unsigned long                                      bFlushAILogEachLine : 1;                                  // 0x03C8(0x0004) (Edit, Config)
	unsigned long                                      bMapBasedLogName : 1;                                     // 0x03C8(0x0004) (Edit, Config)
	unsigned long                                      bAIDrawDebug : 1;                                         // 0x03C8(0x0004) (Edit, Config)
	unsigned long                                      bAIBroken : 1;                                            // 0x03C8(0x0004) (Transient)
	class UGameAICommand*                              CommandList;                                              // 0x03CC(0x0004) (Edit, Const, Transient, EditInline)
	class AFileLog*                                    AILogFile;                                                // 0x03D0(0x0004) (Transient)
	float                                              DebugTextMaxLen;                                          // 0x03D4(0x0004) (Edit)
	TArray<struct FAICmdHistoryItem>                   CommandHistory;                                           // 0x03D8(0x000C) (Edit, Const, Transient, NeedCtorLink)
	int                                                CommandHistoryNum;                                        // 0x03E4(0x0004) (Edit, Config)
	TArray<struct FName>                               AILogFilter;                                              // 0x03E8(0x000C) (Edit, Config, NeedCtorLink)
	struct FString                                     DemoActionString;                                         // 0x03F4(0x000C) (Net, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameAIController");
		return ptr;
	}


	struct FString GetActionString();
	void SetDesiredRotation(const struct FRotator& TargetDesiredRotation, bool InLockDesiredRotation, bool InUnlockWhenReached, float InterpolationTime);
	void AILog_Internal(const struct FString& LogText, const struct FName& LogCategory, bool bForce);
	void RecordDemoAILog(const struct FString& LogText);
	void Destroyed();
	void ReachedIntermediateMoveGoal();
	void ReachedMoveGoal();
	float GetDestinationOffset();
	class UGameAICommand* GetAICommandInStack(class UClass* InClass);
	class UGameAICommand* FindCommandOfClass(class UClass* SearchClass);
	void DumpCommandStack();
	void CheckCommandCount();
	class UGameAICommand* GetActiveCommand();
	bool AbortCommand(class UGameAICommand* AbortCmd, class UClass* AbortClass);
	void PopCommand(class UGameAICommand* ToBePoppedCommand);
	void PushCommand(class UGameAICommand* NewCommand);
	void AllCommands(class UClass* BaseClass, class UGameAICommand** Cmd);
};


// Class GameFramework.GameAICommand
// 0x001C (0x0058 - 0x003C)
class UGameAICommand : public UAICommandBase
{
public:
	class UGameAICommand*                              ChildCommand;                                             // 0x003C(0x0004) (Edit, Const, Transient, EditInline)
	struct FName                                       ChildStatus;                                              // 0x0040(0x0008) (Edit, Const, Transient)
	class AGameAIController*                           GameAIOwner;                                              // 0x0048(0x0004) (Edit, Transient)
	struct FName                                       Status;                                                   // 0x004C(0x0008) (Edit, Transient)
	unsigned long                                      bAllowNewSameClassInstance : 1;                           // 0x0054(0x0004)
	unsigned long                                      bReplaceActiveSameClassInstance : 1;                      // 0x0054(0x0004)
	unsigned long                                      bAborted : 1;                                             // 0x0054(0x0004) (Transient)
	unsigned long                                      bIgnoreNotifies : 1;                                      // 0x0054(0x0004)
	unsigned long                                      bIgnoreStepAside : 1;                                     // 0x0054(0x0004)
	unsigned long                                      bPendingPop : 1;                                          // 0x0054(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameAICommand");
		return ptr;
	}


	struct FString GetDebugVerboseText();
	void GetDebugOverheadText(class APlayerController* PC, TArray<struct FString>* OutText);
	void DrawDebug(class AHUD* H, const struct FName& Category);
	struct FString GetDumpString();
	void Resumed(const struct FName& OldCommandName);
	void Paused(class UGameAICommand* NewCommand);
	void Popped();
	void Pushed();
	void PostPopped();
	void PrePushed(class AGameAIController* AI);
	bool AllowStateTransitionTo(const struct FName& StateName);
	bool AllowTransitionTo(class UClass* AttemptCommand);
	void Tick(float DeltaTime);
	bool ShouldIgnoreNotifies();
	void InternalTick(float DeltaTime);
	void InternalResumed(const struct FName& OldCommandName);
	void InternalPaused(class UGameAICommand* NewCommand);
	void InternalPopped();
	void InternalPushed();
	void InternalPrePushed(class AGameAIController* AI);
	bool InitCommand(class AGameAIController* AI);
	bool InitCommandUserActor(class AGameAIController* AI, class AActor* UserActor);
};


// Class GameFramework.GameCameraBlockingVolume
// 0x0000 (0x0204 - 0x0204)
class AGameCameraBlockingVolume : public ABlockingVolume
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCameraBlockingVolume");
		return ptr;
	}

};


// Class GameFramework.GameCrowdAgent
// 0x01E8 (0x03C0 - 0x01D8)
class AGameCrowdAgent : public ACrowdAgentBase
{
public:
	class UGameCrowdGroup*                             MyGroup;                                                  // 0x01D8(0x0004)
	struct FVector                                     PreferredVelocity;                                        // 0x01DC(0x000C)
	float                                              AvoidanceShare;                                           // 0x01E8(0x0004)
	class AGameCrowdDestination*                       CurrentDestination;                                       // 0x01EC(0x0004)
	class AGameCrowdDestination*                       BehaviorDestination;                                      // 0x01F0(0x0004)
	class AGameCrowdDestination*                       PreviousDestination;                                      // 0x01F4(0x0004)
	struct FVector                                     ExternalForce;                                            // 0x01F8(0x000C)
	float                                              InterpZTranslation;                                       // 0x0204(0x0004)
	int                                                Health;                                                   // 0x0208(0x0004) (Edit)
	float                                              DeadBodyDuration;                                         // 0x020C(0x0004) (Edit)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x0210(0x0004) (Const, ExportObject, EditConst, Component, EditInline)
	int                                                ConformTraceFrameCount;                                   // 0x0214(0x0004) (Transient)
	int                                                AwareUpdateFrameCount;                                    // 0x0218(0x0004) (Transient)
	TArray<class AActor*>                              NearbyDynamics;                                           // 0x021C(0x000C) (Transient, NeedCtorLink)
	TArray<class AGameCrowdForcePoint*>                RelevantAttractors;                                       // 0x0228(0x000C) (Transient, NeedCtorLink)
	unsigned long                                      bUniformScale : 1;                                        // 0x0234(0x0004)
	unsigned long                                      bCheckForObstacles : 1;                                   // 0x0234(0x0004) (Edit)
	unsigned long                                      bUseNavMeshPathing : 1;                                   // 0x0234(0x0004) (Edit)
	unsigned long                                      bWantsSeePlayerNotification : 1;                          // 0x0234(0x0004)
	unsigned long                                      bAllowPitching : 1;                                       // 0x0234(0x0004) (Edit)
	unsigned long                                      bHitObstacle : 1;                                         // 0x0234(0x0004)
	unsigned long                                      bBadHitNormal : 1;                                        // 0x0234(0x0004)
	unsigned long                                      bSimulateThisTick : 1;                                    // 0x0234(0x0004)
	unsigned long                                      bClampMovementSpeed : 1;                                  // 0x0234(0x0004) (Edit)
	unsigned long                                      bPotentialEncounter : 1;                                  // 0x0234(0x0004)
	unsigned long                                      bIsPanicked : 1;                                          // 0x0234(0x0004)
	unsigned long                                      bWantsGroupIdle : 1;                                      // 0x0234(0x0004)
	unsigned long                                      bPreferVisibleDestination : 1;                            // 0x0234(0x0004) (Edit)
	unsigned long                                      bPreferVisibleDestinationOnSpawn : 1;                     // 0x0234(0x0004) (Edit)
	unsigned long                                      bHasNotifiedSpawner : 1;                                  // 0x0234(0x0004)
	unsigned long                                      bIsInSpawnPool : 1;                                       // 0x0234(0x0004)
	TEnumAsByte<EConformType>                          ConformType;                                              // 0x0238(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0239(0x0003) MISSED OFFSET
	float                                              ConformTraceDist;                                         // 0x023C(0x0004) (Edit)
	int                                                ConformTraceInterval;                                     // 0x0240(0x0004) (Edit)
	int                                                CurrentConformTraceInterval;                              // 0x0244(0x0004)
	float                                              LastGroundZ;                                              // 0x0248(0x0004)
	float                                              AwareRadius;                                              // 0x024C(0x0004) (Edit)
	int                                                AwareUpdateInterval;                                      // 0x0250(0x0004) (Edit)
	float                                              AvoidOtherStrength;                                       // 0x0254(0x0004) (Edit)
	float                                              AvoidPlayerStrength;                                      // 0x0258(0x0004) (Edit)
	float                                              AvoidOtherRadius;                                         // 0x025C(0x0004) (Edit)
	float                                              GroupAttractionStrength;                                  // 0x0260(0x0004) (Edit)
	float                                              MatchVelStrength;                                         // 0x0264(0x0004) (Edit)
	float                                              FollowPathStrength;                                       // 0x0268(0x0004) (Edit)
	float                                              VelocityDamping;                                          // 0x026C(0x0004) (Edit)
	float                                              RotateToTargetSpeed;                                      // 0x0270(0x0004) (Edit)
	float                                              MaxYawRate;                                               // 0x0274(0x0004) (Edit)
	struct FVector                                     MeshMinScale3D;                                           // 0x0278(0x000C) (Edit)
	struct FVector                                     MeshMaxScale3D;                                           // 0x0284(0x000C) (Edit)
	float                                              EyeZOffset;                                               // 0x0290(0x0004)
	float                                              ProximityLODDist;                                         // 0x0294(0x0004) (Edit)
	float                                              VisibleProximityLODDist;                                  // 0x0298(0x0004) (Edit)
	struct FVector                                     LastKnownGoodPosition;                                    // 0x029C(0x000C)
	float                                              GroundOffset;                                             // 0x02A8(0x0004) (Edit)
	struct FVector                                     IntermediatePoint;                                        // 0x02AC(0x000C)
	struct FVector                                     SearchExtent;                                             // 0x02B8(0x000C)
	class UClass*                                      NavigationHandleClass;                                    // 0x02C4(0x0004)
	class UNavigationHandle*                           NavigationHandle;                                         // 0x02C8(0x0004)
	int                                                ObstacleCheckCount;                                       // 0x02CC(0x0004)
	float                                              WalkableFloorZ;                                           // 0x02D0(0x0004)
	float                                              LastPathingAttempt;                                       // 0x02D4(0x0004)
	float                                              LastUpdateTime;                                           // 0x02D8(0x0004)
	float                                              NotVisibleLifeSpan;                                       // 0x02DC(0x0004) (Edit)
	float                                              NotVisibleTickScalingFactor;                              // 0x02E0(0x0004) (Edit)
	class AGameCrowdAgent*                             MyArchetype;                                              // 0x02E4(0x0004)
	float                                              MaxWalkingSpeed;                                          // 0x02E8(0x0004) (Edit)
	float                                              MaxRunningSpeed;                                          // 0x02EC(0x0004) (Edit)
	float                                              MaxSpeed;                                                 // 0x02F0(0x0004)
	TArray<struct FRecentInteraction>                  RecentInteractions;                                       // 0x02F4(0x000C) (NeedCtorLink)
	float                                              BeaconMaxDist;                                            // 0x0300(0x0004)
	struct FVector                                     BeaconOffset;                                             // 0x0304(0x000C)
	class UTexture2D*                                  BeaconTexture;                                            // 0x0310(0x0004) (Const)
	struct FLinearColor                                BeaconColor;                                              // 0x0314(0x0010) (Const)
	class USoundCue*                                   AmbientSoundCue;                                          // 0x0324(0x0004) (Edit)
	class UAudioComponent*                             AmbientSoundComponent;                                    // 0x0328(0x0004) (ExportObject, Component, EditInline)
	class UGameCrowdAgentBehavior*                     CurrentBehavior;                                          // 0x032C(0x0004)
	TArray<struct FBehaviorEntry>                      EncounterAgentBehaviors;                                  // 0x0330(0x000C) (Edit, NeedCtorLink)
	TArray<struct FBehaviorEntry>                      SeePlayerBehaviors;                                       // 0x033C(0x000C) (Edit, NeedCtorLink)
	float                                              MaxSeePlayerDistSq;                                       // 0x0348(0x0004)
	float                                              SeePlayerInterval;                                        // 0x034C(0x0004) (Edit)
	TArray<struct FBehaviorEntry>                      SpawnBehaviors;                                           // 0x0350(0x000C) (Edit, NeedCtorLink)
	TArray<struct FBehaviorEntry>                      PanicBehaviors;                                           // 0x035C(0x000C) (Edit, NeedCtorLink)
	TArray<struct FBehaviorEntry>                      RandomBehaviors;                                          // 0x0368(0x000C) (Edit, NeedCtorLink)
	TArray<struct FBehaviorEntry>                      TakeDamageBehaviors;                                      // 0x0374(0x000C) (Edit, NeedCtorLink)
	float                                              RandomBehaviorInterval;                                   // 0x0380(0x0004) (Edit)
	float                                              ForceUpdateTime;                                          // 0x0384(0x0004)
	float                                              ReachThreshold;                                           // 0x0388(0x0004)
	TArray<struct FBehaviorEntry>                      GroupWaitingBehaviors;                                    // 0x038C(0x000C) (Edit, NeedCtorLink)
	float                                              DesiredGroupRadius;                                       // 0x0398(0x0004) (Edit)
	float                                              DesiredGroupRadiusSq;                                     // 0x039C(0x0004)
	float                                              MaxLOSLifeDistanceSq;                                     // 0x03A0(0x0004)
	TScriptInterface<class UGameCrowdSpawnerInterface> MySpawner;                                                // 0x03A4(0x0008)
	struct FVector                                     SpawnOffset;                                              // 0x03AC(0x000C)
	float                                              InitialLastRenderTime;                                    // 0x03B8(0x0004)
	float                                              ForceAmountToIgnorePathForces;                            // 0x03BC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgent");
		return ptr;
	}


	struct FString GetBehaviorString();
	struct FString GetDestString();
	void PostRenderFor(class APlayerController* PC, class UCanvas* Canvas, const struct FVector& CameraPosition, const struct FVector& CameraDir);
	void NativePostRenderFor(class APlayerController* PC, class UCanvas* Canvas, const struct FVector& CameraPosition, const struct FVector& CameraDir);
	struct FVector GeneratePathToActor(class AActor* Goal, float WithinDistance, bool bAllowPartialPath);
	void InitNavigationHandle();
	void OverlappedActorEvent(class AActor* A);
	void TakeDamage(int DamageAmount, class AController* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser);
	void FireDeathEvent();
	void PlayDeath(const struct FVector& KillMomentum);
	void UpdateIntermediatePoint(class AActor* DestinationActor);
	bool CalcCamera(float fDeltaTime, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV);
	bool IsIdle();
	void SetCurrentBehavior(class UGameCrowdAgentBehavior* BehaviorArchetype);
	void StopBehavior();
	void ActivateInstancedBehavior(class UGameCrowdAgentBehavior* NewBehaviorObject);
	void ActivateBehavior(class UGameCrowdAgentBehavior* NewBehaviorArchetype, class AActor* LookAtActor);
	void ResetSeePlayer();
	void TryRandomBehavior();
	void NotifySeePlayer(class APlayerController* PC);
	void PlaySpawnBehavior();
	void HandlePotentialAgentEncounter();
	void StopIdleAnimation();
	void PlayIdleAnimation();
	void OnPlayAgentAnimation(class USeqAct_PlayAgentAnimation* Action);
	void InitializeAgent(class AActor* SpawnLoc, class AGameCrowdAgent* AgentTemplate, class UGameCrowdGroup* NewGroup, float AgentWarmupTime, bool bWarmupPosition, bool bCheckWarmupVisibility);
	void SetLighting(bool bEnableLightEnvironment, const struct FLightingChannelContainer& AgentLightingChannel, bool bCastShadows);
	void DisplayDebug(class AHUD* HUD, float* out_YL, float* out_YPos);
	void Destroyed();
	void ResetPooledAgent();
	void KillAgent();
	void PostBeginPlay();
	void SetMaxSpeed();
	void SetCurrentDestination(class AGameCrowdDestination* NewDest);
	void WaitForGroupMembers();
	bool PickBehaviorFrom(TArray<struct FBehaviorEntry> BehaviorList, const struct FVector& BestCameraLoc);
	void SetPanic(class AActor* PanicActor, bool bNewPanic);
	bool IsPanicked();
	void FellOutOfWorld(class UClass* dmgType);
};


// Class GameFramework.GameCrowdAgentSkeletal
// 0x0080 (0x0440 - 0x03C0)
class AGameCrowdAgentSkeletal : public AGameCrowdAgent
{
public:
	class USkeletalMeshComponent*                      SkeletalMeshComponent;                                    // 0x03C0(0x0004) (Edit, ExportObject, Component, EditInline)
	class UAnimNodeBlend*                              SpeedBlendNode;                                           // 0x03C4(0x0004)
	class UAnimNodeSlot*                               FullBodySlot;                                             // 0x03C8(0x0004)
	class UAnimNodeSequence*                           ActionSeqNode;                                            // 0x03CC(0x0004)
	class UAnimNodeSequence*                           WalkSeqNode;                                              // 0x03D0(0x0004)
	class UAnimNodeSequence*                           RunSeqNode;                                               // 0x03D4(0x0004)
	class UAnimTree*                                   AgentTree;                                                // 0x03D8(0x0004)
	TArray<struct FName>                               WalkAnimNames;                                            // 0x03DC(0x000C) (Edit, NeedCtorLink)
	TArray<struct FName>                               RunAnimNames;                                             // 0x03E8(0x000C) (Edit, NeedCtorLink)
	TArray<struct FName>                               IdleAnimNames;                                            // 0x03F4(0x000C) (Edit, NeedCtorLink)
	TArray<struct FName>                               DeathAnimNames;                                           // 0x0400(0x000C) (Edit, NeedCtorLink)
	float                                              SpeedBlendStart;                                          // 0x040C(0x0004) (Edit)
	float                                              SpeedBlendEnd;                                            // 0x0410(0x0004) (Edit)
	float                                              AnimVelRate;                                              // 0x0414(0x0004) (Edit)
	float                                              MaxSpeedBlendChangeSpeed;                                 // 0x0418(0x0004) (Edit)
	struct FName                                       MoveSyncGroupName;                                        // 0x041C(0x0008) (Edit)
	TArray<struct FGameCrowdAttachmentList>            Attachments;                                              // 0x0424(0x000C) (Edit, NeedCtorLink)
	float                                              MaxTargetAcquireTime;                                     // 0x0430(0x0004) (Edit)
	unsigned long                                      bUseRootMotionVelocity : 1;                               // 0x0434(0x0004) (Edit)
	unsigned long                                      bIsPlayingIdleAnimation : 1;                              // 0x0434(0x0004)
	unsigned long                                      bIsPlayingDeathAnimation : 1;                             // 0x0434(0x0004)
	unsigned long                                      bAnimateThisTick : 1;                                     // 0x0434(0x0004)
	float                                              MaxAnimationDistance;                                     // 0x0438(0x0004) (Edit)
	float                                              MaxAnimationDistanceSq;                                   // 0x043C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentSkeletal");
		return ptr;
	}


	void CreateAttachments();
	void OnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void StopIdleAnimation();
	void PlayIdleAnimation();
	void ClearLatentAnimation();
	void OnPlayAgentAnimation(class USeqAct_PlayAgentAnimation* Action);
	void SetRootMotion(bool bRootMotionEnabled);
	void PlayDeath(const struct FVector& KillMomentum);
	void SetLighting(bool bEnableLightEnvironment, const struct FLightingChannelContainer& AgentLightingChannel, bool bCastShadows);
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdAgentBehavior
// 0x0018 (0x0054 - 0x003C)
class UGameCrowdAgentBehavior : public UObject
{
public:
	unsigned long                                      bIdleBehavior : 1;                                        // 0x003C(0x0004) (Edit)
	unsigned long                                      bFaceActionTargetFirst : 1;                               // 0x003C(0x0004) (Edit)
	unsigned long                                      bIsViralBehavior : 1;                                     // 0x003C(0x0004) (Edit)
	unsigned long                                      bPassOnIsViralBehaviorFlag : 1;                           // 0x003C(0x0004) (Edit)
	unsigned long                                      bIsPanicked : 1;                                          // 0x003C(0x0004)
	class AActor*                                      ActionTarget;                                             // 0x0040(0x0004)
	float                                              MaxPlayerDistance;                                        // 0x0044(0x0004) (Edit)
	float                                              DurationOfViralBehaviorPropagation;                       // 0x0048(0x0004) (Edit)
	float                                              TimeToStopPropagatingViralBehavior;                       // 0x004C(0x0004) (Transient)
	class AGameCrowdAgent*                             MyAgent;                                                  // 0x0050(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAgentBehavior");
		return ptr;
	}


	bool AllowBehaviorAt(class AGameCrowdDestination* Destination);
	bool AllowThisDestination(class AGameCrowdDestination* Destination);
	void PropagateViralBehaviorTo(class AGameCrowdAgent* OtherAgent);
	void ActivatedBy(class AActor* NewActionTarget);
	class AActor* GetDestinationActor();
	void ChangingDestination(class AGameCrowdDestination* NewDest);
	struct FString GetBehaviorString();
	void OnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void StopBehavior();
	void InitBehavior(class AGameCrowdAgent* Agent);
	bool HandleMovement();
	void FinishedTargetRotation();
	bool CanBeUsedBy(class AGameCrowdAgent* Agent, const struct FVector& CameraLoc);
	void Tick(float DeltaTime);
	bool ShouldEndIdle();
};


// Class GameFramework.GameCrowdBehavior_PlayAnimation
// 0x002C (0x0080 - 0x0054)
class UGameCrowdBehavior_PlayAnimation : public UGameCrowdAgentBehavior
{
public:
	TArray<struct FName>                               AnimationList;                                            // 0x0054(0x000C) (Edit, NeedCtorLink)
	float                                              BlendInTime;                                              // 0x0060(0x0004) (Edit)
	float                                              BlendOutTime;                                             // 0x0064(0x0004) (Edit)
	unsigned long                                      bUseRootMotion : 1;                                       // 0x0068(0x0004) (Edit)
	unsigned long                                      bLookAtPlayer : 1;                                        // 0x0068(0x0004) (Edit)
	unsigned long                                      bLooping : 1;                                             // 0x0068(0x0004) (Edit)
	unsigned long                                      bBlendBetweenAnims : 1;                                   // 0x0068(0x0004) (Edit)
	class AActor*                                      CustomActionTarget;                                       // 0x006C(0x0004)
	int                                                LoopIndex;                                                // 0x0070(0x0004) (Edit)
	float                                              LoopTime;                                                 // 0x0074(0x0004) (Edit)
	class USeqAct_PlayAgentAnimation*                  AnimSequence;                                             // 0x0078(0x0004)
	int                                                AnimationIndex;                                           // 0x007C(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_PlayAnimation");
		return ptr;
	}


	struct FString GetBehaviorString();
	void StopBehavior();
	void PlayAgentAnimationNow();
	void OnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void SetSequenceOutput();
	void FinishedTargetRotation();
	void InitBehavior(class AGameCrowdAgent* Agent);
};


// Class GameFramework.GameCrowdBehavior_RunFromPanic
// 0x000C (0x0060 - 0x0054)
class UGameCrowdBehavior_RunFromPanic : public UGameCrowdAgentBehavior
{
public:
	class AActor*                                      PanicFocus;                                               // 0x0054(0x0004) (Transient)
	float                                              DurationOfPanic;                                          // 0x0058(0x0004) (Edit)
	float                                              TimeToStopPanic;                                          // 0x005C(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_RunFromPanic");
		return ptr;
	}


	void Tick(float DeltaTime);
	struct FString GetBehaviorString();
	bool AllowBehaviorAt(class AGameCrowdDestination* Destination);
	bool AllowThisDestination(class AGameCrowdDestination* Destination);
	void PropagateViralBehaviorTo(class AGameCrowdAgent* OtherAgent);
	void StopBehavior();
	void InitBehavior(class AGameCrowdAgent* Agent);
	void ActivatedBy(class AActor* NewActionTarget);
};


// Class GameFramework.GameCrowdBehavior_WaitForGroup
// 0x0000 (0x0054 - 0x0054)
class UGameCrowdBehavior_WaitForGroup : public UGameCrowdAgentBehavior
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitForGroup");
		return ptr;
	}


	void StopBehavior();
	bool ShouldEndIdle();
	struct FString GetBehaviorString();
	void InitBehavior(class AGameCrowdAgent* Agent);
};


// Class GameFramework.GameCrowdBehavior_WaitInQueue
// 0x0008 (0x005C - 0x0054)
class UGameCrowdBehavior_WaitInQueue : public UGameCrowdAgentBehavior
{
public:
	unsigned long                                      bStoppingBehavior : 1;                                    // 0x0054(0x0004)
	class AGameCrowdDestinationQueuePoint*             QueuePosition;                                            // 0x0058(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdBehavior_WaitInQueue");
		return ptr;
	}


	void StopBehavior();
	bool ShouldEndIdle();
	struct FString GetBehaviorString();
	class AActor* GetDestinationActor();
	void ChangingDestination(class AGameCrowdDestination* NewDest);
	bool HandleMovement();
};


// Class GameFramework.GameCrowdGroup
// 0x000C (0x0048 - 0x003C)
class UGameCrowdGroup : public UObject
{
public:
	TArray<class AGameCrowdAgent*>                     Members;                                                  // 0x003C(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdGroup");
		return ptr;
	}


	void UpdateDestinations(class AGameCrowdDestination* NewDestination);
	void RemoveMember(class AGameCrowdAgent* Agent);
	void AddMember(class AGameCrowdAgent* Agent);
};


// Class GameFramework.GameCrowdInteractionPoint
// 0x0008 (0x01DC - 0x01D4)
class AGameCrowdInteractionPoint : public AActor
{
public:
	unsigned long                                      bIsEnabled : 1;                                           // 0x01D4(0x0004) (Edit, Net)
	class UCylinderComponent*                          CylinderComponent;                                        // 0x01D8(0x0004) (Edit, ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdInteractionPoint");
		return ptr;
	}


	void OnToggle(class USeqAct_Toggle* Action);
};


// Class GameFramework.GameCrowdDestination
// 0x0084 (0x0260 - 0x01DC)
class AGameCrowdDestination : public AGameCrowdInteractionPoint
{
public:
	struct FPointer                                    VfTable_IEditorLinkSelectionInterface;                    // 0x01DC(0x0004) (Const, Native, NoExport)
	unsigned long                                      bKillWhenReached : 1;                                     // 0x01E0(0x0004) (Edit)
	unsigned long                                      bAllowAsPreviousDestination : 1;                          // 0x01E0(0x0004) (Edit)
	unsigned long                                      bLastAllowableResult : 1;                                 // 0x01E0(0x0004)
	unsigned long                                      bAvoidWhenPanicked : 1;                                   // 0x01E0(0x0004) (Edit)
	unsigned long                                      bSkipBehaviorIfPanicked : 1;                              // 0x01E0(0x0004) (Edit)
	unsigned long                                      bFleeDestination : 1;                                     // 0x01E0(0x0004) (Edit)
	unsigned long                                      bMustReachExactly : 1;                                    // 0x01E0(0x0004) (Edit)
	unsigned long                                      bHasRestrictions : 1;                                     // 0x01E0(0x0004)
	unsigned long                                      bAllowsSpawning : 1;                                      // 0x01E0(0x0004) (Edit)
	unsigned long                                      bLineSpawner : 1;                                         // 0x01E0(0x0004) (Edit)
	unsigned long                                      bSpawnAtEdge : 1;                                         // 0x01E0(0x0004) (Edit)
	unsigned long                                      bSoftPerimeter : 1;                                       // 0x01E0(0x0004) (Edit)
	unsigned long                                      bIsVisible : 1;                                           // 0x01E0(0x0004)
	unsigned long                                      bWillBeVisible : 1;                                       // 0x01E0(0x0004)
	unsigned long                                      bCanSpawnHereNow : 1;                                     // 0x01E0(0x0004)
	unsigned long                                      bIsBeyondSpawnDistance : 1;                               // 0x01E0(0x0004)
	unsigned long                                      bAdjacentToVisibleNode : 1;                               // 0x01E0(0x0004)
	unsigned long                                      bHasNavigationMesh : 1;                                   // 0x01E0(0x0004)
	TArray<class AGameCrowdDestination*>               NextDestinations;                                         // 0x01E4(0x000C) (Edit, DuplicateTransient, NeedCtorLink)
	class AGameCrowdDestinationQueuePoint*             QueueHead;                                                // 0x01F0(0x0004) (Edit, DuplicateTransient)
	int                                                Capacity;                                                 // 0x01F4(0x0004) (Edit)
	float                                              Frequency;                                                // 0x01F8(0x0004) (Edit)
	int                                                CustomerCount;                                            // 0x01FC(0x0004)
	TArray<class UClass*>                              SupportedAgentClasses;                                    // 0x0200(0x000C) (Edit, NeedCtorLink)
	TArray<class UObject*>                             SupportedArchetypes;                                      // 0x020C(0x000C) (Edit, NeedCtorLink)
	TArray<class UClass*>                              RestrictedAgentClasses;                                   // 0x0218(0x000C) (Edit, NeedCtorLink)
	TArray<class UObject*>                             RestrictedArchetypes;                                     // 0x0224(0x000C) (Edit, NeedCtorLink)
	float                                              ExactReachTolerance;                                      // 0x0230(0x0004)
	struct FName                                       InteractionTag;                                           // 0x0234(0x0008) (Edit)
	float                                              InteractionDelay;                                         // 0x023C(0x0004) (Edit)
	float                                              SpawnRadius;                                              // 0x0240(0x0004) (Edit)
	TArray<struct FBehaviorEntry>                      ReachedBehaviors;                                         // 0x0244(0x000C) (Edit, NeedCtorLink)
	class AGameCrowdAgent*                             AgentEnRoute;                                             // 0x0250(0x0004)
	float                                              Priority;                                                 // 0x0254(0x0004)
	float                                              LastSpawnTime;                                            // 0x0258(0x0004)
	class AGameCrowdPopulationManager*                 MyPopMgr;                                                 // 0x025C(0x0004) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdDestination");
		return ptr;
	}


	void GetSpawnPosition(class USeqAct_GameCrowdSpawner* Spawner, struct FVector* SpawnPos, struct FRotator* SpawnRot);
	bool AllowableDestinationFor(class AGameCrowdAgent* Agent);
	bool AtCapacity();
	void IncrementCustomerCount(class AGameCrowdAgent* ArrivingAgent);
	void DecrementCustomerCount(class AGameCrowdAgent* DepartingAgent);
	void PickNewDestinationFor(class AGameCrowdAgent* Agent, bool bIgnoreRestrictions);
	void ReachedDestination(class AGameCrowdAgent* Agent);
	void Destroyed();
	void PostBeginPlay();
	bool ReachedByAgent(class AGameCrowdAgent* Agent, const struct FVector& TestPosition, bool bTestExactly);
};


// Class GameFramework.GameCrowdDestinationQueuePoint
// 0x001C (0x01F8 - 0x01DC)
class AGameCrowdDestinationQueuePoint : public AGameCrowdInteractionPoint
{
public:
	class AGameCrowdDestinationQueuePoint*             NextQueuePosition;                                        // 0x01DC(0x0004) (Edit)
	class AGameCrowdInteractionPoint*                  PreviousQueuePosition;                                    // 0x01E0(0x0004)
	class AGameCrowdAgent*                             QueuedAgent;                                              // 0x01E4(0x0004)
	class AGameCrowdDestination*                       QueueDestination;                                         // 0x01E8(0x0004) (Transient)
	unsigned long                                      bClearingQueue : 1;                                       // 0x01EC(0x0004)
	unsigned long                                      bPendingAdvance : 1;                                      // 0x01EC(0x0004)
	float                                              AverageReactionTime;                                      // 0x01F0(0x0004) (Edit)
	class UClass*                                      QueueBehaviorClass;                                       // 0x01F4(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdDestinationQueuePoint");
		return ptr;
	}


	bool HasCustomer();
	void ClearQueue(class AGameCrowdAgent* OldCustomer);
	void AddCustomer(class AGameCrowdAgent* NewCustomer, class AGameCrowdInteractionPoint* PreviousPosition);
	void ActuallyAdvance();
	void AdvanceCustomerTo(class AGameCrowdInteractionPoint* FrontPosition);
	void ReachedDestination(class AGameCrowdAgent* Agent);
	bool HasSpace();
	bool QueueReachedBy(class AGameCrowdAgent* Agent, const struct FVector& TestPosition);
};


// Class GameFramework.GameCrowdForcePoint
// 0x0000 (0x01DC - 0x01DC)
class AGameCrowdForcePoint : public AGameCrowdInteractionPoint
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdForcePoint");
		return ptr;
	}


	struct FVector AppliedForce(class AGameCrowdAgent* Agent);
	void UnTouch(class AActor* Other);
	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
};


// Class GameFramework.GameCrowdAttractor
// 0x0008 (0x01E4 - 0x01DC)
class AGameCrowdAttractor : public AGameCrowdForcePoint
{
public:
	float                                              Attraction;                                               // 0x01DC(0x0004) (Edit, Interp)
	unsigned long                                      bAttractionFalloff : 1;                                   // 0x01E0(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdAttractor");
		return ptr;
	}


	struct FVector AppliedForce(class AGameCrowdAgent* Agent);
};


// Class GameFramework.GameCrowdRepulsor
// 0x0008 (0x01E4 - 0x01DC)
class AGameCrowdRepulsor : public AGameCrowdForcePoint
{
public:
	float                                              Repulsion;                                                // 0x01DC(0x0004) (Edit, Interp)
	unsigned long                                      bAttractionFalloff : 1;                                   // 0x01E0(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdRepulsor");
		return ptr;
	}


	struct FVector AppliedForce(class AGameCrowdAgent* Agent);
};


// Class GameFramework.SeqAct_GameCrowdSpawner
// 0x0058 (0x0150 - 0x00F8)
class USeqAct_GameCrowdSpawner : public USeqAct_Latent
{
public:
	unsigned long                                      bSpawningActive : 1;                                      // 0x00F8(0x0004)
	unsigned long                                      bCycleSpawnLocs : 1;                                      // 0x00F8(0x0004) (Edit)
	unsigned long                                      bRespawnDeadAgents : 1;                                   // 0x00F8(0x0004) (Edit)
	unsigned long                                      bHasReducedNumberDueToSplitScreen : 1;                    // 0x00F8(0x0004)
	unsigned long                                      bEnableCrowdLightEnvironment : 1;                         // 0x00F8(0x0004) (Edit)
	unsigned long                                      bForceObstacleChecking : 1;                               // 0x00F8(0x0004) (Edit)
	unsigned long                                      bForceNavMeshPathing : 1;                                 // 0x00F8(0x0004) (Edit)
	unsigned long                                      bOnlySpawnHidden : 1;                                     // 0x00F8(0x0004) (Edit)
	unsigned long                                      bWarmupPosition : 1;                                      // 0x00F8(0x0004) (Edit)
	unsigned long                                      bCastShadows : 1;                                         // 0x00F8(0x0004) (Edit)
	int                                                NextDestinationIndex;                                     // 0x00FC(0x0004)
	TArray<class AActor*>                              SpawnLocs;                                                // 0x0100(0x000C) (Transient, NeedCtorLink)
	int                                                LastSpawnLocIndex;                                        // 0x010C(0x0004) (Transient)
	float                                              SpawnRate;                                                // 0x0110(0x0004) (Edit)
	int                                                SpawnNum;                                                 // 0x0114(0x0004) (Edit)
	float                                              SpawnRadius;                                              // 0x0118(0x0004) (Edit)
	float                                              SplitScreenNumReduction;                                  // 0x011C(0x0004) (Edit)
	float                                              Remainder;                                                // 0x0120(0x0004)
	float                                              AgentFrequencySum;                                        // 0x0124(0x0004)
	class UGameCrowd_ListOfAgents*                     CrowdAgentList;                                           // 0x0128(0x0004) (Edit)
	TArray<struct FAgentArchetypeInfo>                 AgentArchetypes;                                          // 0x012C(0x000C) (Transient, NeedCtorLink)
	TArray<class AGameCrowdAgent*>                     SpawnedList;                                              // 0x0138(0x000C) (Transient, NeedCtorLink)
	struct FLightingChannelContainer                   AgentLightingChannel;                                     // 0x0144(0x0004) (Edit)
	class AGameCrowdReplicationActor*                  RepActor;                                                 // 0x0148(0x0004)
	float                                              AgentWarmupTime;                                          // 0x014C(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.SeqAct_GameCrowdSpawner");
		return ptr;
	}


	int GetObjClassVersion();
	class AGameCrowdAgent* CreateNewAgent(class AActor* SpawnLoc, class AGameCrowdAgent* AgentTemplate, class UGameCrowdGroup* NewGroup);
	class AGameCrowdAgent* SpawnAgent(class AActor* SpawnLoc);
	void UpdateSpawning(float DeltaSeconds);
	void KillAgents();
	void CacheSpawnerVars();
	void SpawnedAgent(class AGameCrowdAgent* NewAgent);
};


// Class GameFramework.GameCrowdPopulationManager
// 0x0098 (0x026C - 0x01D4)
class AGameCrowdPopulationManager : public ACrowdPopulationManagerBase
{
public:
	struct FPointer                                    VfTable_IInterface_NavigationHandle;                      // 0x01D4(0x0004) (Const, Native, NoExport)
	unsigned long                                      bSpawningActive : 1;                                      // 0x01D8(0x0004)
	unsigned long                                      bEnableCrowdLightEnvironment : 1;                         // 0x01D8(0x0004)
	unsigned long                                      bCastShadows : 1;                                         // 0x01D8(0x0004)
	unsigned long                                      bForceObstacleChecking : 1;                               // 0x01D8(0x0004)
	unsigned long                                      bForceNavMeshPathing : 1;                                 // 0x01D8(0x0004)
	unsigned long                                      bHaveInitialPopulation : 1;                               // 0x01D8(0x0004)
	unsigned long                                      bWarmupPosition : 1;                                      // 0x01D8(0x0004) (Edit)
	float                                              SpawnRate;                                                // 0x01DC(0x0004)
	int                                                SpawnNum;                                                 // 0x01E0(0x0004)
	float                                              SplitScreenNumReduction;                                  // 0x01E4(0x0004)
	float                                              Remainder;                                                // 0x01E8(0x0004)
	float                                              AgentFrequencySum;                                        // 0x01EC(0x0004)
	TArray<struct FAgentArchetypeInfo>                 AgentArchetypes;                                          // 0x01F0(0x000C) (NeedCtorLink)
	TArray<class AGameCrowdAgent*>                     AgentPool;                                                // 0x01FC(0x000C) (NeedCtorLink)
	int                                                MaxAgentPoolSize;                                         // 0x0208(0x0004)
	int                                                AgentCount;                                               // 0x020C(0x0004)
	struct FLightingChannelContainer                   AgentLightingChannel;                                     // 0x0210(0x0004)
	float                                              AgentWarmupTime;                                          // 0x0214(0x0004)
	float                                              SpawnPrioritizationInterval;                              // 0x0218(0x0004)
	int                                                PrioritizationIndex;                                      // 0x021C(0x0004)
	int                                                PrioritizationUpdateIndex;                                // 0x0220(0x0004)
	TArray<class AGameCrowdDestination*>               PrioritizedSpawnPoints;                                   // 0x0224(0x000C) (NeedCtorLink)
	float                                              PlayerPositionPredictionTime;                             // 0x0230(0x0004)
	TArray<class AGameCrowdDestination*>               PotentialSpawnPoints;                                     // 0x0234(0x000C) (NeedCtorLink)
	float                                              MaxSpawnDist;                                             // 0x0240(0x0004)
	float                                              MaxSpawnDistSq;                                           // 0x0244(0x0004)
	float                                              MinBehindSpawnDistSq;                                     // 0x0248(0x0004)
	int                                                SpawnedCount;                                             // 0x024C(0x0004)
	int                                                PoolCount;                                                // 0x0250(0x0004)
	int                                                KilledCount;                                              // 0x0254(0x0004)
	float                                              HeadVisibilityOffset;                                     // 0x0258(0x0004)
	float                                              InitialPopulationPct;                                     // 0x025C(0x0004)
	class UClass*                                      NavigationHandleClass;                                    // 0x0260(0x0004)
	class UNavigationHandle*                           NavigationHandle;                                         // 0x0264(0x0004)
	class AGameCrowdAgent*                             QueryingAgent;                                            // 0x0268(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdPopulationManager");
		return ptr;
	}


	class AGameCrowdAgent* CreateNewAgent(class AGameCrowdDestination* SpawnLoc, class AGameCrowdAgent* AgentTemplate, class UGameCrowdGroup* NewGroup);
	class AGameCrowdAgent* SpawnAgent(class AGameCrowdDestination* SpawnLoc);
	bool ValidateSpawnAt(class AGameCrowdDestination* Candidate);
	void AddPrioritizedSpawnPoint(class AGameCrowdDestination* GCD, const struct FVector& ViewLocation);
	void AnalyzeSpawnPoints(int StartIndex, int StopIndex, const struct FVector& ViewLocation, const struct FVector& PredictionLocation);
	void PrioritizeSpawnPoints(float DeltaSeconds);
	class AGameCrowdDestination* PickSpawnPoint();
	void Tick(float DeltaSeconds);
	bool IsSpawningActive();
	void DisplayDebug(class AHUD* HUD, float* out_YL, float* out_YPos);
	bool AddToAgentPool(class AGameCrowdAgent* Agent);
	void AgentDestroyed(class AGameCrowdAgent* Agent);
	void FlushAgents();
	void OnGameCrowdPopulationManagerToggle(class USeqAct_GameCrowdPopulationManagerToggle* inAction);
	void RemoveSpawnPoint(class AGameCrowdDestination* GCD);
	void AddSpawnPoint(class AGameCrowdDestination* GCD);
	float GetMaxSpawnDist();
	void NotifyPathChanged();
	void PostBeginPlay();
};


// Class GameFramework.GameCrowdReplicationActor
// 0x000C (0x01E0 - 0x01D4)
class AGameCrowdReplicationActor : public AActor
{
public:
	class USeqAct_GameCrowdSpawner*                    Spawner;                                                  // 0x01D4(0x0004) (Net, RepNotify)
	unsigned long                                      bSpawningActive : 1;                                      // 0x01D8(0x0004) (Net, RepNotify)
	int                                                DestroyAllCount;                                          // 0x01DC(0x0004) (Net, RepNotify)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameCrowdReplicationActor");
		return ptr;
	}


	void ReplicatedEvent(const struct FName& VarName);
};


// Class GameFramework.GameDestinationConnRenderingComponent
// 0x0000 (0x01D8 - 0x01D8)
class UGameDestinationConnRenderingComponent : public UPrimitiveComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class GameFramework.GameDestinationConnRenderingComponent");
		return ptr;
	}

};


// Class GameFramework.GameExplosion
// 0x00A8 (0x00E4 - 0x003C)
class UGameExplosion : public UObject
{
public:
	unsigned long                                      bDirectionalExplosion : 1;                                // 0x003C(0x0004) (Edit)
	unsigned long                                      bIgnoreInstigator : 1;                                    // 0x003C(0x0004) (Transient)
	unsigned long                                      bAllowTeammateCringes : 1;                                // 0x003C(0x0004) (Edit)
	unsigned long                                      bFullDamageToAttachee : 1;                                // 0x003C(0x0004) (Transient)
	unsigned long                                      bAttachExplosionEmitterToAttachee : 1;                    // 0x003C(0x0004) (Edit)
	unsigned long                                      bPerformRadialBlurRelevanceCheck : 1;                     // 0x003C(0x0004) (Edit)
	unsigned long                                      bCausesFracture : 1;                                      // 0x003C(0x0004) (Edit)
	unsigned long                                      bAllowPerMaterialFX : 1;                                  // 0x003C(0x0004) (Edit)
	unsigned long                                      bParticleSystemIsBeingOverriddenDontUsePhysMatVersion : 1;// 0x003C(0x0004) (Edit)
	unsigned long                                      bUseMapSpecificValues : 1;                                // 0x003C(0x0004) (Edit)
	unsigned long                                      bUseOverlapCheck : 1;                                     // 0x003C(0x0004) (Edit)
	unsigned long                                      bOrientCameraShakeTowardsEpicenter : 1;                   // 0x003C(0x0004) (Edit)
	unsigned long                                      bAutoControllerVibration : 1;                             // 0x003C(0x0004) (Edit)
	float                                              DirectionalExplosionAngleDeg;                             // 0x0040(0x0004) (Edit)
	float                                              DamageDelay;                                              // 0x0044(0x0004) (Edit)
	float                                              Damage;                                                   // 0x0048(0x0004) (Edit)
	float                                              DamageRadius;                                             // 0x004C(0x0004) (Edit)
	float                                              DamageFalloffExponent;                                    // 0x0050(0x0004) (Edit)
	class AActor*                                      ActorToIgnoreForDamage;                                   // 0x0054(0x0004) (Transient)
	class UClass*                                      ActorClassToIgnoreForDamage;                              // 0x0058(0x0004) (Edit)
