#pragma once

// Antichamber (1.0.7977.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Hazard.HazardGlassPanel
// 0x0010 (0x01E4 - 0x01D4)
class AHazardGlassPanel : public AActor
{
public:
	class UStaticMeshComponent*                        GlassMesh;                                                // 0x01D4(0x0004) (Edit, ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        GlassMesh2;                                               // 0x01D8(0x0004) (Edit, ExportObject, Component, EditInline)
	class UMaterialInstanceConstant*                   GlassMaterial;                                            // 0x01DC(0x0004)
	unsigned long                                      bBlockSnakeBeam : 1;                                      // 0x01E0(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Hazard.HazardGlassPanel");
		return ptr;
	}


	void PostBeginPlay();
};


// Class Hazard.HazardAmbientSoundMovable
// 0x0028 (0x0208 - 0x01E0)
class AHazardAmbientSoundMovable : public AAmbientSoundMovable
{
public:
	TArray<class AHazardAmbientSoundMovable*>          DuplicatedSounds;                                         // 0x01E0(0x000C) (Edit, NeedCtorLink)
	float                                              MaxDistance;                                              // 0x01EC(0x0004) (Edit)
	float                                              OriginalMaxDistance;                                      // 0x01F0(0x0004)
	struct FVector                                     OriginalLocation;                                         // 0x01F4(0x000C)
	unsigned long                                      bOriginalCanTeleport : 1;                                 // 0x0200(0x0004)
	unsigned long                                      bCanTeleport : 1;                                         // 0x0200(0x0004)
	unsigned long                                      bTeleported : 1;                                          // 0x0200(0x0004)
	unsigned long                                      bKicked : 1;                                              // 0x0200(0x0004)
	unsigned long                                      bStored : 1;                                              // 0x0200(0x0004)
	unsigned long                                      bTicking : 1;                                             // 0x0200(0x0004)
	class AHazardPawn*                                 PlayerPawn;                                               // 0x0204(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Hazard.HazardAmbientSoundMovable");
		return ptr;
	}


	void RestoreDuplicatedSounds();
	void KickDuplicatedSounds();
	void Tick(float DeltaTime);
	void UpdateAmbientSound();
	void ResetHASM(bool bResetLocation, bool bResetMaxDistance, bool bResetCanTeleport);
	void PostBeginPlay();
};


// Class Hazard.HazardGame
// 0x02D0 (0x064C - 0x037C)
class AHazardGame : public AUDKGame
{
public:
	float                                              HackTealTileTakeTime;                                     // 0x037C(0x0004)
	class AHazardRecursiveCylinder*                    RecursiveCylinder;                                        // 0x0380(0x0004)
	unsigned long                                      bRetryFailedSnake : 1;                                    // 0x0384(0x0004)
	unsigned long                                      bSnakeStopHack : 1;                                       // 0x0384(0x0004)
	unsigned long                                      bBreakSearch : 1;                                         // 0x0384(0x0004)
	unsigned long                                      bLastDirection : 1;                                       // 0x0384(0x0004)
	unsigned long                                      bAutoRotated : 1;                                         // 0x0384(0x0004)
	unsigned long                                      bHiddenSignHints : 1;                                     // 0x0384(0x0004)
	unsigned long                                      bShowSignClickHelp : 1;                                   // 0x0384(0x0004)
	unsigned long                                      bTriggeredIconThreshold : 1;                              // 0x0384(0x0004)
	unsigned long                                      bGameLoaded : 1;                                          // 0x0384(0x0004)
	unsigned long                                      bTimerActive : 1;                                         // 0x0384(0x0004)
	unsigned long                                      bAlgorithmTimerActive : 1;                                // 0x0384(0x0004)
	unsigned long                                      bSaveConfig : 1;                                          // 0x0384(0x0004)
	unsigned long                                      bFadingSnake : 1;                                         // 0x0384(0x0004)
	unsigned long                                      bFadingMaterialize : 1;                                   // 0x0384(0x0004)
	unsigned long                                      bFadingAppear : 1;                                        // 0x0384(0x0004)
	unsigned long                                      bFadingDisappear : 1;                                     // 0x0384(0x0004)
	unsigned long                                      bFadingDisintegrate : 1;                                  // 0x0384(0x0004)
	unsigned long                                      bFadingWhite : 1;                                         // 0x0384(0x0004)
	unsigned long                                      bFadingWhite1 : 1;                                        // 0x0384(0x0004)
	unsigned long                                      bFadingWhite2 : 1;                                        // 0x0384(0x0004)
	unsigned long                                      bCalcMouseSensitivity : 1;                                // 0x0384(0x0004)
	float                                              RefindTime;                                               // 0x0388(0x0004)
	float                                              LastHoverTime;                                            // 0x038C(0x0004)
	class USoundCue*                                   HoverSound;                                               // 0x0390(0x0004)
	class USoundCue*                                   ClickSound;                                               // 0x0394(0x0004)
	float                                              LoopDelayTimer;                                           // 0x0398(0x0004)
	float                                              LoopSpawnTimer;                                           // 0x039C(0x0004)
	int                                                GrowingComponents;                                        // 0x03A0(0x0004)
	int                                                ShrinkingComponents;                                      // 0x03A4(0x0004)
	int                                                LoopingComponents;                                        // 0x03A8(0x0004)
	TArray<struct FString>                             LoopKeys;                                                 // 0x03AC(0x000C) (NeedCtorLink)
	TArray<struct FLoopBox>                            LoopBoxPoints;                                            // 0x03B8(0x000C) (Component, NeedCtorLink)
	TArray<struct FFurthestPoint>                      FurthestPoints;                                           // 0x03C4(0x000C) (Component, NeedCtorLink)
	int                                                FurthestDistance;                                         // 0x03D0(0x0004)
	TArray<struct FRecursePoint>                       RecursePoints;                                            // 0x03D4(0x000C) (Component, NeedCtorLink)
	int                                                ClosestRecurseDistance;                                   // 0x03E0(0x0004)
	float                                              TileSize;                                                 // 0x03E4(0x0004)
	float                                              HalfTileSize;                                             // 0x03E8(0x0004)
	float                                              SnakeDelayTime;                                           // 0x03EC(0x0004)
	float                                              ConstructDelayTime;                                       // 0x03F0(0x0004)
	TArray<class UHazardTileComponent*>                RegeneratingComponents;                                   // 0x03F4(0x000C) (ExportObject, Component, NeedCtorLink, EditInline)
	TEnumAsByte<ECurrentAxis>                          CurrentAxis;                                              // 0x0400(0x0001)
	unsigned char                                      UnlockedTowers[0x9];                                      // 0x0401(0x0001)
	TEnumAsByte<EHazardGame_ENeighbourDir>             NeighbourDir;                                             // 0x040A(0x0001) (Const)
	unsigned char                                      UnknownData00[0x1];                                       // 0x040B(0x0001) MISSED OFFSET
	struct FVector                                     LastTracePoint;                                           // 0x040C(0x000C)
	struct FVector                                     BuildEndPoint;                                            // 0x0418(0x000C)
	struct FVector                                     BuildStartPoint;                                          // 0x0424(0x000C)
	struct FVector                                     SnakeHeadLocation;                                        // 0x0430(0x000C)
	float                                              LastSnakeTime;                                            // 0x043C(0x0004)
	class AHazardMapPreview*                           MapPreview;                                               // 0x0440(0x0004)
	class AHazardIconPreview*                          IconPreview;                                              // 0x0444(0x0004)
	TArray<class AHazardStepTile*>                     StepTiles;                                                // 0x0448(0x000C) (NeedCtorLink)
	class AHazardTile*                                 BlueTile;                                                 // 0x0454(0x0004)
	class AHazardTile*                                 GreenTile;                                                // 0x0458(0x0004)
	class AHazardTile*                                 YellowTile;                                               // 0x045C(0x0004)
	class AHazardTile*                                 RedTile;                                                  // 0x0460(0x0004)
	class AHazardTile*                                 BlackTile;                                                // 0x0464(0x0004)
	class UMaterialInterface*                          BlueTileMaterial;                                         // 0x0468(0x0004)
	class UMaterialInterface*                          GreenTileMaterial;                                        // 0x046C(0x0004)
	class UMaterialInterface*                          YellowTileMaterial;                                       // 0x0470(0x0004)
	class UMaterialInterface*                          RedTileMaterial;                                          // 0x0474(0x0004)
	class UMaterialInterface*                          BlackTileMaterial;                                        // 0x0478(0x0004)
	int                                                NumSignsClicked;                                          // 0x047C(0x0004)
	int                                                NumIconsFound;                                            // 0x0480(0x0004)
	int                                                IconThreshold;                                            // 0x0484(0x0004)
	TArray<class UClass*>                              DefaultInventory;                                         // 0x0488(0x000C) (NeedCtorLink)
	class UHazardSaveGame*                             SavedGame;                                                // 0x0494(0x0004)
	float                                              PlayTime;                                                 // 0x0498(0x0004)
	TArray<class AHazardTrigger*>                      SavedTriggers;                                            // 0x049C(0x000C) (NeedCtorLink)
	TArray<class AHazardPickupFactory*>                SavedPickups;                                             // 0x04A8(0x000C) (NeedCtorLink)
	TArray<class AHazardOptionsButton*>                SavedOptions;                                             // 0x04B4(0x000C) (NeedCtorLink)
	TArray<class AHazardSecretTile*>                   SavedSecrets;                                             // 0x04C0(0x000C) (NeedCtorLink)
	TArray<class AActor*>                              SavedActors;                                              // 0x04CC(0x000C) (NeedCtorLink)
	TArray<class AActor*>                              FoundActors;                                              // 0x04D8(0x000C) (NeedCtorLink)
	TArray<class AHazardLaser*>                        FoundLasers;                                              // 0x04E4(0x000C) (NeedCtorLink)
	TArray<class AHazardTriggerMap*>                   FoundMap;                                                 // 0x04F0(0x000C) (NeedCtorLink)
	TArray<class AHazardOptionsButton*>                FoundOptions;                                             // 0x04FC(0x000C) (NeedCtorLink)
	class AHazardPawn*                                 PlayerPawn;                                               // 0x0508(0x0004)
	float                                              UnlockDelay;                                              // 0x050C(0x0004)
	float                                              LastUnlockTime;                                           // 0x0510(0x0004)
	class UMaterialInterface*                          BaseMaterial;                                             // 0x0514(0x0004)
	class AHazardPlayerController*                     ThePlayer;                                                // 0x0518(0x0004)
	class ADynamicSMActor*                             MapWall;                                                  // 0x051C(0x0004)
	class ADynamicSMActor*                             IconWall;                                                 // 0x0520(0x0004)
	class AStaticMeshActor*                            ChamberMesh;                                              // 0x0524(0x0004)
	class ADynamicSMActor*                             IconPictureSheet;                                         // 0x0528(0x0004)
	class ADynamicSMActor*                             IconMessageSheet;                                         // 0x052C(0x0004)
	class ADynamicSMActor*                             IconTitleSheet;                                           // 0x0530(0x0004)
	class ASceneCapture2DActor*                        LevelCapture;                                             // 0x0534(0x0004)
	class AActor*                                      JumpLocation;                                             // 0x0538(0x0004)
	TArray<class AHazardTriggerMap*>                   MapArray;                                                 // 0x053C(0x000C) (NeedCtorLink)
	TArray<class AHazardTriggerMap*>                   TempMapArray;                                             // 0x0548(0x000C) (NeedCtorLink)
	class UParticleSystem*                             MapStartTemplate;                                         // 0x0554(0x0004)
	class AEmitterSpawnable*                           MapStartEmitter;                                          // 0x0558(0x0004)
	class UParticleSystem*                             MapEndTemplate;                                           // 0x055C(0x0004)
	class AEmitterSpawnable*                           MapEndEmitter;                                            // 0x0560(0x0004)
	TArray<class UDecalComponent*>                     StaticDecals;                                             // 0x0564(0x000C) (ExportObject, Component, NeedCtorLink, EditInline)
	TArray<class AHazardAmbientSoundMovable*>          MovableSounds;                                            // 0x0570(0x000C) (NeedCtorLink)
	TArray<class AHazardTowerMesh*>                    TowerActors;                                              // 0x057C(0x000C) (NeedCtorLink)
	float                                              AppearSoundTime;                                          // 0x0588(0x0004)
	float                                              DisappearSoundTime;                                       // 0x058C(0x0004)
	class UAudioComponent*                             AppearSound;                                              // 0x0590(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             DisappearSound;                                           // 0x0594(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             DisintegrateSound;                                        // 0x0598(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             SnakeSound;                                               // 0x059C(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             MaterializeSound;                                         // 0x05A0(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             WhiteSound;                                               // 0x05A4(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             WhiteSound1;                                              // 0x05A8(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             WhiteSound2;                                              // 0x05AC(0x0004) (ExportObject, Component, EditInline)
	float                                              SnakeSoundTime;                                           // 0x05B0(0x0004)
	float                                              MaterializeSoundTime;                                     // 0x05B4(0x0004)
	float                                              DisintegrateSoundTime;                                    // 0x05B8(0x0004)
	float                                              WhiteSoundTime;                                           // 0x05BC(0x0004)
	float                                              WhiteSoundStartTime;                                      // 0x05C0(0x0004)
	struct FVector                                     ClosestAppearLocation;                                    // 0x05C4(0x000C)
	struct FVector                                     ClosestDisappearLocation;                                 // 0x05D0(0x000C)
	struct FVector                                     ClosestDisintegrateLocation;                              // 0x05DC(0x000C)
	struct FVector                                     ClosestSnakeLocation;                                     // 0x05E8(0x000C)
	struct FVector                                     ClosestMaterializeLocation;                               // 0x05F4(0x000C)
	struct FVector                                     ClosestWhiteLocation;                                     // 0x0600(0x000C)
	struct FName                                       PersistentLevel;                                          // 0x060C(0x0008)
	class AHazardIcon*                                 FirstIcon;                                                // 0x0614(0x0004)
	float                                              DefaultMouseSensitivity;                                  // 0x0618(0x0004)
	struct FVector                                     LinkedLocation;                                           // 0x061C(0x000C)
	struct FVector                                     LinkStartTrace;                                           // 0x0628(0x000C)
	struct FVector                                     LinkAimDir;                                               // 0x0634(0x000C)
	class UParticleSystem*                             ProjExplosionTemplate;                                    // 0x0640(0x0004)
	class USoundCue*                                   ExplodeSound;                                             // 0x0644(0x0004)
	class UAudioComponent*                             ExplodeSoundLoop;                                         // 0x0648(0x0004) (ExportObject, Component, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Hazard.HazardGame");
		return ptr;
	}


	void UpdateNumIconsFound();
	bool HitNoShootField(const struct FVector& SearchLocation);
	struct FVector GetAxisAsVector();
	void SetCurrentAxis(const struct FVector& HitLocation, const struct FVector& StartLocation);
	void AddDefaultInventory(class APawn* P);
	void SaveGame();
	void DeleteSaveGame();
	void HideSignHints();
	void UnsaveObject(class AActor* Other);
	void SaveObject(class AActor* Other);
	void Tick(float DeltaTime);
	void UpdateSounds(float DeltaTime);
	void SetWhiteSoundParameters(const struct FVector& UpdateLocation);
	void UpdateDecals();
	void AddDecal(class UDecalComponent* NewDecal);
	void SetupTile(class UMaterialInterface* SetupMaterial, bool bNewDestroyOnOpen, class AHazardTile** SetupTile);
	void SetupDefaultTiles();
	void LoadSavedGame(class AHazardPawn* Pawn);
	void InitializeGame();
	bool ShouldUpdate(class AActor* CheckActor, float UpdateDistance);
	void ResetGunTiles();
	void ResetGame();
	void KillMapEmitters();
	void SpawnMapEmitters(const struct FVector& SpawnLocation);
	void DeactivateMap();
	void DeactivateMapNode(class AHazardTriggerMap* TempNode);
	void SaveMap();
	void ActivateMap(class AHazardTriggerMap* MapTrigger);
	void UnlockTower(int TowerLevel);
	void RegisterTowerPiece(class AHazardTowerMesh* CurrentMesh);
	class UHazardTileComponent* FindTileComponent(const struct FVector& SearchLocation, class UHazardTileComponent* CallingComponent);
	void TestKillBlocking(class UHazardTileComponent* TestComponent, const struct FVector& TestLocation);
	void SpawnLoop();
	void CheckTimers();
	bool TimerFinished(float* Time);
	void PostLogin(class APlayerController* NewPlayer);
	class UClass* SetGameType(const struct FString& MapName, const struct FString& Options, const struct FString& Portal);
	bool PointInBox(const struct FVector& Point, const struct FVector& TestBoxLocation, const struct FVector& TestBoxExtent);
	void NormalizeActor(class AActor* Target);
	struct FVector GetNextPointOnLine(const struct FVector& EndPoint, const struct FVector& StartPoint, float inTileSize);
	int RoundToScale(float Value, int roundScale);
	struct FVector RoundVectorToScale(const struct FVector& Value, int roundScale);
	struct FVector getIndexNormal(int NeighbourIndex);
	int getMinLocationIndex(const struct FVector& SearchLocation);
	int getLocationIndex(const struct FVector& SearchLocation);
	int RotateAroundAxis(int InitialDirection, int PlaneAxis, int inNumRotations);
	float CeilValue(float Value, int significance);
	float FloorValue(float Value, int significance);
	float ManhattanVSize(const struct FVector& StartLocation, const struct FVector& EndLocation);
};


// Class Hazard.HazardConsole
// 0x0000 (0x01C8 - 0x01C8)
class UHazardConsole : public UUTConsole
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Hazard.HazardConsole");
		return ptr;
	}


	bool InputKey(int ControllerId, const struct FName& Key, TEnumAsByte<EInputEvent> Event, float AmountDepressed, bool bGamepad);
};


// Class Hazard.HazardActor
// 0x0009 (0x01DD - 0x01D4)
class AHazardActor : public AActor
{
public:
	unsigned long                                      bShouldUpdate : 1;                                        // 0x01D4(0x0004)
	float                                              LastFoundTime;                                            // 0x01D8(0x0004)
	TEnumAsByte<EHazardActor_EGlobalCollision>         GlobalCollision;                                          // 0x01DC(0x0001)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Hazard.HazardActor");
		return ptr;
	}


	void EnableTick();
	void TestDisableTick();
	void Tick(float DeltaTime);
	bool ShouldUpdate();
};


// Class Hazard.HazardPawn
// 0x0111 (0x0741 - 0x0630)
class AHazardPawn : public AUDKPawn
{
public:
	struct FVector                                     OldLocation;                                              // 0x0630(0x000C)
	class UHazardSnakeFloorComponent*                  CurrentSnakePanel;                                        // 0x063C(0x0004) (ExportObject, Component, EditInline)
	unsigned long                                      bShouldCheckSnake : 1;                                    // 0x0640(0x0004)
	unsigned long                                      bUpdatePawnLocation : 1;                                  // 0x0640(0x0004)
	unsigned long                                      bStepFloorsActive : 1;                                    // 0x0640(0x0004)
	unsigned long                                      bBasedOnTile : 1;                                         // 0x0640(0x0004)
	unsigned long                                      bShouldRecheckStep : 1;                                   // 0x0640(0x0004)
	unsigned long                                      bWeaponBob : 1;                                           // 0x0640(0x0004)
	unsigned long                                      bJustLanded : 1;                                          // 0x0640(0x0004)
	unsigned long                                      bLandRecovery : 1;                                        // 0x0640(0x0004)
	unsigned long                                      bJumped : 1;                                              // 0x0640(0x0004)
	unsigned long                                      bPlayingNoAmmoNear : 1;                                   // 0x0640(0x0004)
	unsigned long                                      bPlayNoAmmoEnterSound : 1;                                // 0x0640(0x0004)
	unsigned long                                      bPlayNoAmmoExitSound : 1;                                 // 0x0640(0x0004)
	unsigned long                                      bFadingSlowFall : 1;                                      // 0x0640(0x0004)
	unsigned long                                      bFadingMedFall : 1;                                       // 0x0640(0x0004)
	unsigned long                                      bFadingFastFall : 1;                                      // 0x0640(0x0004)
	unsigned long                                      bFadingTerminalFall : 1;                                  // 0x0640(0x0004)
	float                                              MaxJumpThrowVelocity;                                     // 0x0644(0x0004)
	float                                              JumpDownStopTime;                                         // 0x0648(0x0004)
	float                                              JumpDownDelay;                                            // 0x064C(0x0004)
	struct FVector                                     UpdateForce;                                              // 0x0650(0x000C)
	float                                              LastStepTime;                                             // 0x065C(0x0004)
	float                                              LastOverlapCheckTime;                                     // 0x0660(0x0004)
	float                                              DefaultOverlapRadius;                                     // 0x0664(0x0004)
	float                                              OverlapRadius;                                            // 0x0668(0x0004)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x066C(0x0004) (ExportObject, Component, EditInline)
	float                                              DefaultAirControl;                                        // 0x0670(0x0004)
	float                                              Bob;                                                      // 0x0674(0x0004)
	float                                              LandBob;                                                  // 0x0678(0x0004)
	float                                              JumpBob;                                                  // 0x067C(0x0004)
	float                                              AppliedBob;                                               // 0x0680(0x0004)
	float                                              bobtime;                                                  // 0x0684(0x0004)
	struct FVector                                     WalkBob;                                                  // 0x0688(0x000C)
	class UForceFeedbackWaveform*                      FallingDamageWaveForm;                                    // 0x0694(0x0004)
	struct FName                                       PawnEffectSockets[0x2];                                   // 0x0698(0x0008)
	struct FVector                                     GridLocation;                                             // 0x06A8(0x000C)
	float                                              StoredZVelocity;                                          // 0x06B4(0x0004)
	float                                              FlingVelocity;                                            // 0x06B8(0x0004)
	class UClass*                                      SoundGroupClass;                                          // 0x06BC(0x0004)
	TArray<class AHazardFootstepVolume*>               FootstepVolumes;                                          // 0x06C0(0x000C) (NeedCtorLink)
	TArray<class AHazardFootstepVolume*>               PushVolumes;                                              // 0x06CC(0x000C) (NeedCtorLink)
	TArray<class AHazardDuplicateVolume*>              DuplicateVolumes;                                         // 0x06D8(0x000C) (NeedCtorLink)
	class UAudioComponent*                             LaserSound;                                               // 0x06E4(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             NoShootSoundNear;                                         // 0x06E8(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             NoShootSoundFar;                                          // 0x06EC(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             NoAmmoSoundNear;                                          // 0x06F0(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             NoAmmoSoundFar;                                           // 0x06F4(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             NoAmmoEnterSound;                                         // 0x06F8(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             NoAmmoExitSound;                                          // 0x06FC(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             NoAmmoLoseAmmoSound;                                      // 0x0700(0x0004) (ExportObject, Component, EditInline)
	float                                              ClosestNoShoot;                                           // 0x0704(0x0004)
	float                                              ClosestNoAmmo;                                            // 0x0708(0x0004)
	float                                              NoAmmoEntryTime;                                          // 0x070C(0x0004)
	struct FName                                       PreviousSoundMode;                                        // 0x0710(0x0008)
	struct FVector                                     LastLocation;                                             // 0x0718(0x000C)
	float                                              WallTolerance;                                            // 0x0724(0x0004)
	int                                                NumRetries;                                               // 0x0728(0x0004)
	int                                                MaxRetries;                                               // 0x072C(0x0004)
	class UAudioComponent*                             SlowFallingSound;                                         // 0x0730(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             MedFallingSound;                                          // 0x0734(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             FastFallingSound;                                         // 0x0738(0x0004) (ExportObject, Component, EditInline)
	class UAudioComponent*                             TerminalFallingSound;                                     // 0x073C(0x0004) (ExportObject, Component, EditInline)
	TEnumAsByte<EHazardPawn_ENeighbourDir>             NeighbourDir;                                             // 0x0740(0x0001) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Hazard.HazardPawn");
		return ptr;
	}


	bool NeedToTurn(const struct FVector& targ);
	void PossessedBy(class AController* C, bool bVehicleTransition);
	void RigidBodyCollision(class UPrimitiveComponent* HitComponent, class UPrimitiveComponent* OtherComponent, int ContactIndex, struct FCollisionImpactData* RigidCollisionData);
	struct FRotator GetViewRotation();
	bool IsFirstPerson();
	bool GetPuttingDownWeapon();
	void SetPuttingDownWeapon(bool bNowPuttingDownWeapon);
	void FiringModeUpdated(class AWeapon* InWeapon, unsigned char InFiringMode, bool bViaReplication);
	class USoundCue* GetWeaponAmbientSound();
	void SetWeaponAmbientSound(class USoundCue* NewAmbientSound);
	class USoundCue* GetPawnAmbientSound();
	void SetPawnAmbientSound(class USoundCue* NewAmbientSound);
	void DisplayDebug(class AHUD* HUD, float* out_YL, float* out_YPos);
	void StopFlying();
	void StartFlying();
	struct FVector GetWeaponStartTraceLocation(class AWeapon* CurrentWeapon);
	void AddDefaultInventory();
	void Destroyed();
	TEnumAsByte<EMaterialType> GetMaterialBelowFeet();
	class AHazardFootstepVolume* GetFootstepVolume();
	void PlayFootStepSound(int FootDown);
	struct FString GetDebugName();
	void ClientRestart();
	void EndViewTarget(class APlayerController* PC);
	struct FVector GetPawnViewLocation();
	void UpdateEyeHeight(float DeltaTime);
	void UpdatePushSounds();
	void FaceRotation(const struct FRotator& NewRotation, float DeltaTime);
	struct FString GetScreenName();
	float GetEyeHeight();
	bool StopWeaponFiring();
	bool StopFiring();
	void AddVelocity(const struct FVector& NewVelocity, const struct FVector& HitLocation, class UClass* DamageType, const struct FTraceHitInfo& HitInfo);
	void Falling();
	void TurnOff();
	struct FVector WeaponBob(float BobDamping, float JumpDamping);
	void SpawnDefaultController();
	void SetAnimRateScale(float RateScale);
	void ReattachMesh();
	void PostBeginPlay();
	void PlayFootSounds(class USoundCue* CurrentSound);
	void ActuallyPlayWalkingFootstepSound(int FootDown);
	void ActuallyPlayRunningFootstepSound(int FootDown);
	void PlayJumpingSound();
	void PlayLandingSound();
	bool DoJump(bool bUpdating);
	void DoDoubleJump(bool bUpdating);
	void Landed(const struct FVector& HitNormal, class AActor* FloorActor);
	void PlayTeleportEffect(bool bOut, bool bSound);
	bool CalcCamera(float fDeltaTime, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV);
	void CheckRecurseStep();
	void FindRecurseFloor();
	void ActivateStepFloors(bool bActive);
	void BaseChange();
	void UpdateFallingSound();
	void UpdateNoAmmoSounds();
	void CheckSnakeStep();
	void FindSnakeFloor();
	void Tick(float DeltaTime);
	void HitWall(const struct FVector& HitNormal, class AActor* Wall, class UPrimitiveComponent* WallComp);
	void Bump(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitNormal);
	bool CheatFly();
	bool CheatGhost();
	bool CheatWalk();
	void SetWalking(bool bNewIsWalking);
	void StartFire(unsigned char FireModeNum);
	void Interact();
	bool InteractTest(class AActor** InteractActor);
	void InteractGame();
	bool InteractTestGame(class AActor** InteractActor);
	void BecomeViewTarget(class APlayerController* PC);
	void UpdateGridLocation();
	void UntouchedNoAmmo();
	void TouchedNoAmmo();
	bool PointInBox(const struct FVector& Point, const struct FVector& TestBoxLocation, const struct FVector& TestBoxExtent);
	void NormalizeActor(class AActor* Target);
	struct FVector GetNextPointOnLine(const struct FVector& EndPoint, const struct FVector& StartPoint, float inTileSize);
	int RoundToScale(float Value, int roundScale);
	struct FVector RoundVectorToScale(const struct FVector& Value, int roundScale);
	struct FVector getIndexNormal(int NeighbourIndex);
	int getMinLocationIndex(const struct FVector& SearchLocation);
	int getLocationIndex(const struct FVector& SearchLocation);
	int RotateAroundAxis(int InitialDirection, int PlaneAxis, int inNumRotations);
	float CeilValue(float Value, int significance);
	float FloorValue(float Value, int significance);
	float ManhattanVSize(const struct FVector& StartLocation, const struct FVector& EndLocation);
};


// Class Hazard.HazardPlayerController
// 0x0218 (0x09CC - 0x07B4)
class AHazardPlayerController : public AUDKPlayerController
{
public:
	float                                              CreditsFOV;                                               // 0x07B4(0x0004)
	unsigned long                                      bShowingCredits : 1;                                      // 0x07B8(0x0004)
	unsigned long                                      bBlendingCredits : 1;                                     // 0x07B8(0x0004)
	unsigned long                                      bChangedTranslationThreshold : 1;                         // 0x07B8(0x0004)
	unsigned long                                      bNoCrosshair : 1;                                         // 0x07B8(0x0004)
	unsigned long                                      bSimpleCrosshair : 1;                                     // 0x07B8(0x0004)
	unsigned long                                      bCanReturn : 1;                                           // 0x07B8(0x0004)
	unsigned long                                      bExiting : 1;                                             // 0x07B8(0x0004)
	unsigned long                                      bScreenInitialized : 1;                                   // 0x07B8(0x0004)
	unsigned long                                      bInChamber : 1;                                           // 0x07B8(0x0004)
	unsigned long                                      bTransitioning : 1;                                       // 0x07B8(0x0004)
	unsigned long                                      bCapturing : 1;                                           // 0x07B8(0x0004)
	unsigned long                                      bAlternate : 1;                                           // 0x07B8(0x0004)
	unsigned long                                      bAboutToJump : 1;                                         // 0x07B8(0x0004)
	unsigned long                                      bCheckPortals : 1;                                        // 0x07B8(0x0004)
	float                                              CreditsFadeTime;                                          // 0x07BC(0x0004)
	float                                              CreditsBlendAmount;                                       // 0x07C0(0x0004)
	float                                              CreditsBlendTimeToGo;                                     // 0x07C4(0x0004)
	class ASceneCapture2DActor*                        CreditsCamera;                                            // 0x07C8(0x0004)
	class USoundCue*                                   UpgradeSound;                                             // 0x07CC(0x0004)
	float                                              LastUpgradeSoundTime;                                     // 0x07D0(0x0004)
	TEnumAsByte<EWeaponHand>                           WeaponHand;                                               // 0x07D4(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x07D5(0x0003) MISSED OFFSET
	class UMaterialEffect*                             Linework;                                                 // 0x07D8(0x0004)
	class UDrawFrustumComponent*                       DrawFrustum;                                              // 0x07DC(0x0004) (ExportObject, Component, EditInline)
	float                                              TransitionTime;                                           // 0x07E0(0x0004)
	float                                              ExitHoldTime;                                             // 0x07E4(0x0004)
	float                                              ExitPressTime;                                            // 0x07E8(0x0004)
	class UMaterialInstanceConstant*                   LineworkMaterialInstance;                                 // 0x07EC(0x0004) (Transient)
	float                                              BlendAmount;                                              // 0x07F0(0x0004)
	float                                              LastTeleportTime;                                         // 0x07F4(0x0004)
	float                                              LastCaptureTime;                                          // 0x07F8(0x0004)
	struct FRotator                                    InitialRotation;                                          // 0x07FC(0x000C)
	struct FVector                                     InitialLocation;                                          // 0x0808(0x000C)
	struct FVector                                     ChamberLocation;                                          // 0x0814(0x000C)
	struct FRotator                                    ChamberRotation;                                          // 0x0820(0x000C)
	class ASceneCapture2DActor*                        HoloCapture;                                              // 0x082C(0x0004)
	struct FVector2D                                   InitialTextureSize;                                       // 0x0830(0x0008)
	float                                              TextureScale;                                             // 0x0838(0x0004)
	class ASceneCapture2DActor*                        WorldCapture;                                             // 0x083C(0x0004)
	class ASceneCapture2DActor*                        UnlitCapture;                                             // 0x0840(0x0004)
	class ASceneCapture2DActor*                        WireframeCapture;                                         // 0x0844(0x0004)
	class UPostProcessChain*                           UnlitPostProcess;                                         // 0x0848(0x0004)
	class UPostProcessChain*                           WireframePostProcess;                                     // 0x084C(0x0004)
	float                                              UnlitFarPlane;                                            // 0x0850(0x0004)
	float                                              WireframeFarPlane;                                        // 0x0854(0x0004)
	float                                              CaptureRadius;                                            // 0x0858(0x0004)
	class AActor*                                      CurrentRoom;                                              // 0x085C(0x0004)
	class AActor*                                      OtherRoom;                                                // 0x0860(0x0004)
	class UMaterialInstanceConstant*                   WorldMaterial;                                            // 0x0864(0x0004)
	class UMaterialInstanceConstant*                   HolochamberMaterial;                                      // 0x0868(0x0004)
	class UMaterialInstanceConstant*                   UniverseMaterial;                                         // 0x086C(0x0004)
	float                                              HolochamberVolume;                                        // 0x0870(0x0004)
	class AHazardMapNode*                              LastMapNode;                                              // 0x0874(0x0004)
	float                                              JumpTime;                                                 // 0x0878(0x0004)
	struct FVector                                     CamLoc;                                                   // 0x087C(0x000C)
	struct FRotator                                    CamRot;                                                   // 0x0888(0x000C)
	struct FVector                                     Camntl;                                                   // 0x0894(0x000C)
	struct FVector                                     Camntr;                                                   // 0x08A0(0x000C)
	struct FVector                                     Camnbl;                                                   // 0x08AC(0x000C)
	struct FVector                                     Camnbr;                                                   // 0x08B8(0x000C)
	struct FVector                                     Camftl;                                                   // 0x08C4(0x000C)
	struct FVector                                     Camftr;                                                   // 0x08D0(0x000C)
	struct FVector                                     Camfbl;                                                   // 0x08DC(0x000C)
	struct FVector                                     Camfbr;                                                   // 0x08E8(0x000C)
	float                                              CamnearD;                                                 // 0x08F4(0x0004)
	float                                              CamfarD;                                                  // 0x08F8(0x0004)
	float                                              Camratio;                                                 // 0x08FC(0x0004)
	float                                              Camangle;                                                 // 0x0900(0x0004)
	float                                              Camtang;                                                  // 0x0904(0x0004)
	float                                              Camnw;                                                    // 0x0908(0x0004)
	float                                              Camnh;                                                    // 0x090C(0x0004)
	float                                              Camfw;                                                    // 0x0910(0x0004)
	float                                              Camfh;                                                    // 0x0914(0x0004)
	struct FVector                                     CamDir;                                                   // 0x0918(0x000C)
	struct FVector                                     Camnc;                                                    // 0x0924(0x000C)
	struct FVector                                     Camfc;                                                    // 0x0930(0x000C)
	struct FVector                                     CamX;                                                     // 0x093C(0x000C)
	struct FVector                                     CamY;                                                     // 0x0948(0x000C)
	struct FVector                                     CamZ;                                                     // 0x0954(0x000C)
	struct FVector2D                                   CamViewportSize;                                          // 0x0960(0x0008)
	struct FHazardPlane                                ViewFrustum[0x6];                                         // 0x0968(0x0010)
	class AHazardGame*                                 HazardGame;                                               // 0x09C8(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Hazard.HazardPlayerController");
		return ptr;
	}


	void TeamTalk();
	void Talk();
	void DrawHUD(class AHUD* H);
	void UpdateMaterialResolutionsConsoles(class UMaterialInstanceConstant* CurrentMaterial, const struct FVector2D& ViewportSize);
	void UpdateMaterialResolutionsPC(class UMaterialInstanceConstant* CurrentMaterial, const struct FVector2D& ViewportSize, class UTexture* NewTexture);
	void UpdateResolutionsConsoles();
	void UpdateResolutionsPC();
	void UpdateScreenMaterialResolutions();
	struct FString ConsoleCommand(const struct FString& Command, bool bWriteToLog);
	void StopTriFire(unsigned char FireModeNum);
	void StartTriFire(unsigned char FireModeNum);
	void StopFire(unsigned char FireModeNum);
	void StartFire(unsigned char FireModeNum);
	void HandlePickup(class AInventory* Inv);
	void ShowMenu();
	void BlendCredits(float DeltaTime);
	void ShowCredits();
	void NotifyChamberTransition(bool bEnteringChamber);
	void SetFPS(float FrameRate);
	void CancelExit();
	void UpdateChamberCamera(const struct FVector& CameraLocation, const struct FRotator& CameraRotation, float FOV);
	void UpdateCreditsCamera(const struct FVector& CameraLocation, const struct FRotator& CameraRotation, float FOV);
	void UpdateWorldCamera(const struct FVector& CameraLocation, const struct FRotator& CameraRotation, float FOV);
	void DrawCamera(const struct FVector& CameraLocation, const struct FRotator& CameraRotation, float FOV);
	void CalculateViewFrustum(const struct FVector& CameraLocation, const struct FRotator& CameraRotation, float FOV);
	bool ObjectVisible(class AHazardPortal* TestObject);
	bool FacingPlayer(class AHazardPortal* TestObject);
	int TestIntersects(class AHazardPortal* TestObject);
	bool IntersectsPlane(const struct FVector& N, const struct FVector& P0, const struct FVector& P1, const struct FVector& V0, class AHazardPortal* TestObject);
	bool PointWithinFrustum(const struct FVector& Point);
	float DistanceToPlane(const struct FHazardPlane& TestPlane, const struct FVector& Point);
	struct FHazardPlane CreatePlane(const struct FVector& Point1, const struct FVector& Point2, const struct FVector& Point3);
	void ResetGame();
	void ToggleScreenShotMode();
	void PlayerTick(float DeltaTime);
	void HoloJump(const struct FVector& CurrentRoomLocation, const struct FRotator& CurrentRoomRotation, const struct FVector& OtherRoomLocation, const struct FRotator& OtherRoomRotation);
	void SetupScreen();
	void UpdateRotation(float DeltaTime);
	void OnSetSoundMode(class USeqAct_SetSoundMode* Action);
};


// Class Hazard.HazardBlackHole
// 0x00CD (0x02A1 - 0x01D4)
class AHazardBlackHole : public AActor
{
public:
	class AHazardBlackTileEnding*                      EndingTile;                                               // 0x01D4(0x0004)
	class UStaticMeshComponent*                        SpinningMesh;                                             // 0x01D8(0x0004) (Edit, ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        RingMesh;                                                 // 0x01DC(0x0004) (Edit, ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        PenroseTriangle;                                          // 0x01E0(0x0004) (Edit, ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        StandardTriangle;                                         // 0x01E4(0x0004) (Edit, ExportObject, Component, EditInline)
	TArray<class UHazardBlackHoleSphereMesh*>          SphereMeshes;                                             // 0x01E8(0x000C) (ExportObject, Component, NeedCtorLink, EditInline)
	TArray<class UHazardBlackHoleSphereMesh*>          ActiveMeshes;                                             // 0x01F4(0x000C) (ExportObject, Component, NeedCtorLink, EditInline)
	class UStaticMeshComponent*                        GuideMesh;                                                // 0x0200(0x0004) (Edit, ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        BlackHoleMesh;                                            // 0x0204(0x0004) (Edit, ExportObject, Component, EditInline)
	class UPointLightComponent*                        BlackHoleLight;                                           // 0x0208(0x0004) (ExportObject, Component, EditInline)
	class UPointLightComponent*                        BlackHoleExplosionLight;                                  // 0x020C(0x0004) (ExportObject, Component, EditInline)
	float                                              DefaultLightRadius;                                       // 0x0210(0x0004)
	class UStaticMeshComponent*                        BlackDome;                                                // 0x0214(0x0004) (ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        CollisionRing;                                            // 0x0218(0x0004) (ExportObject, Component, EditInline)
	class UStaticMeshComponent*                        CollisionRing2;                                           // 0x021C(0x0004) (ExportObject, Component, EditInline)
	unsigned long                                      bActive : 1;                                              // 0x0220(0x0004)
	unsigned long                                      bShrinkingSpinningMesh : 1;                               // 0x0220(0x0004)
	unsigned long                                      bSpinning : 1;                                            // 0x0220(0x0004)
	unsigned long                                      bAccelerating : 1;                                        // 0x0220(0x0004)
	unsigned long                                      bSpawningSphere : 1;                                      // 0x0220(0x0004)
	unsigned long                                      bSpawnedSphere : 1;                                       // 0x0220(0x0004)
	float                                              DefaultSpinningMeshScale;                                 // 0x0224(0x0004)
	struct FRotator                                    DefaultRingRotation;                                      // 0x0228(0x000C)
	struct FRotator                                    DefaultTriangleRotation;                                  // 0x0234(0x000C)
	float                                              DefaultRingScale;                                         // 0x0240(0x0004)
	float                                              DefaultTriangleScale;                                     // 0x0244(0x0004)
	struct FVector                                     SphereTranslation;                                        // 0x0248(0x000C)
	float                                              DefaultBlackHoleScale;                                    // 0x0254(0x0004)
	int                                                NumUpdating;                                              // 0x0258(0x0004)
	int                                                CurrentUpdating;                                          // 0x025C(0x0004)
	float                                              LastUpdateTime;                                           // 0x0260(0x0004)
	float                                              InterpTime;                                               // 0x0264(0x0004)
	float                                              BlendTimeToGo;                                            // 0x0268(0x0004)
	float                                              BlendAmount;                                              // 0x026C(0x0004)
	float                                              NumToKill;                                                // 0x0270(0x0004)
	float                                              KillDelay;                                                // 0x0274(0x0004)
	float                                              SpinExponent;                                             // 0x0278(0x0004)
	float                                              SpinAmount;                                               // 0x027C(0x0004)
	float                                              SpinBlendAmount;                                          // 0x0280(0x0004)
	float                                              SpinBlendTimeToGo;                                        // 0x0284(0x0004)
	float                                              SpinInterpTime;                                           // 0x0288(0x0004)
	float                                              ExplodeExponent;                                          // 0x028C(0x0004)
	float                                              ExplodeAmount;                                            // 0x0290(0x0004)
	float                                              ExplodeBlendAmount;                                       // 0x0294(0x0004)
	float                                              ExplodeBlendTimeToGo;                                     // 0x0298(0x0004)
	float                                              ExplodeInterpTime;                                        // 0x029C(0x0004)
	TEnumAsByte<EHazardBlackHole_EMode>                Mode;                                                     // 0x02A0(0x0001)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Hazard.HazardBlackHole");
		return ptr;
	}


	void SpinDown(bool bAccelerate, float newSpinInterpTime, float NumRotations, float Exponent);
	void SpinUp(bool bAccelerate, float newSpinInterpTime, float NumRotations, float Exponent);
	void UpdateSpin(float DeltaTime);
	void UpdateExplosion(float DeltaTime);
	void Explode();
	void Tick(float DeltaTime);
	void UpdateSpinningMesh(float DeltaTime);
	void UpdateOpening(float DeltaTime);
	void UpdateActive(float DeltaTime);
	void UpdateDying(float DeltaTime);
	void UpdateShrinkingSpinningMesh(float DeltaTime);
	void ActivateBlackHole();
	void ActivateBlackHoleSphere();
	void ShowRing();
	void TriggerFinalSequence();
	void PostBeginPlay();
};


// Class Hazard.HazardBlackHoleSphereMesh
// 0x0035 (0x0285 - 0x0250)
class UHazardBlackHoleSphereMesh : public UStaticMeshComponent
{
public:
	float                                              InterpTime;                                               // 0x0250(0x0004)
	float                                              BlendTimeToGo;                                            // 0x0254(0x0004)
	float                                              BlendAmount;                                              // 0x0258(0x0004)
	struct FVector                                     DefaultScale3D;                                           // 0x025C(0x000C)
	struct FVector                                     DefaultLocation;                                          // 0x0268(0x000C)
	struct FRotator                                    DefaultRotation;                                          // 0x0274(0x000C)
	class AHazardBlackHole*                            Parent;                                                   // 0x0280(0x0004)
	TEnumAsByte<EHazardBlackHoleSphereMesh_EMode>      Mode;                                                     // 0x0284(0x0001)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Hazard.HazardBlackHoleSphereMesh");
