#pragma once

// Antichamber (1.0.7977.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class UTGame.UTPlayerController
// 0x00E8 (0x089C - 0x07B4)
class AUTPlayerController : public AUDKPlayerController
{
public:
	unsigned long                                      bLateComer : 1;                                           // 0x07B4(0x0004)
	unsigned long                                      bIsTyping : 1;                                            // 0x07B4(0x0004)
	unsigned long                                      bAutoTaunt : 1;                                           // 0x07B4(0x0004) (Config, GlobalConfig)
	unsigned long                                      bUseVehicleRotationOnPossess : 1;                         // 0x07B4(0x0004) (Config, GlobalConfig)
	unsigned long                                      bRotateMinimap : 1;                                       // 0x07B4(0x0004)
	unsigned long                                      bCameraOutOfWorld : 1;                                    // 0x07B4(0x0004)
	unsigned long                                      bFirstPersonWeaponsSelfShadow : 1;                        // 0x07B4(0x0004) (Config, GlobalConfig)
	unsigned long                                      bBehindView : 1;                                          // 0x07B4(0x0004)
	unsigned long                                      bForceBehindView : 1;                                     // 0x07B4(0x0004)
	unsigned long                                      bFreeCamera : 1;                                          // 0x07B4(0x0004)
	unsigned long                                      bNoTextToSpeechVoiceMessages : 1;                         // 0x07B4(0x0004) (Config, GlobalConfig)
	unsigned long                                      bTextToSpeechTeamMessagesOnly : 1;                        // 0x07B4(0x0004) (Config, GlobalConfig)
	unsigned long                                      bCurrentCamAnimIsDamageShake : 1;                         // 0x07B4(0x0004)
	unsigned long                                      bCurrentCamAnimAffectsFOV : 1;                            // 0x07B4(0x0004)
	unsigned long                                      bLandingShake : 1;                                        // 0x07B4(0x0004) (Config, GlobalConfig)
	unsigned long                                      bCenteredWeaponFire : 1;                                  // 0x07B4(0x0004) (Config)
	unsigned long                                      bNonlinearZoomInterpolation : 1;                          // 0x07B4(0x0004) (Transient)
	unsigned long                                      bQuittingToMainMenu : 1;                                  // 0x07B4(0x0004) (Transient)
	unsigned long                                      bDebugFreeCam : 1;                                        // 0x07B4(0x0004) (Transient)
	unsigned long                                      bJustFoundVehicle : 1;                                    // 0x07B4(0x0004)
	unsigned long                                      bNoCrosshair : 1;                                         // 0x07B4(0x0004) (Config)
	unsigned long                                      bSimpleCrosshair : 1;                                     // 0x07B4(0x0004) (Config)
	unsigned long                                      bAlreadyReset : 1;                                        // 0x07B4(0x0004)
	unsigned long                                      bServerMutedText : 1;                                     // 0x07B4(0x0004)
	unsigned long                                      bHideObjectivePaths : 1;                                  // 0x07B4(0x0004) (Config, GlobalConfig)
	unsigned char                                      IdentifiedTeam;                                           // 0x07B8(0x0001)
	TEnumAsByte<EPawnShadowMode>                       PawnShadowMode;                                           // 0x07B9(0x0001) (Config, GlobalConfig)
	TEnumAsByte<EWeaponHand>                           WeaponHandPreference;                                     // 0x07BA(0x0001) (Config, GlobalConfig)
	TEnumAsByte<EWeaponHand>                           WeaponHand;                                               // 0x07BB(0x0001)
	TEnumAsByte<EAutoObjectivePreference>              AutoObjectivePreference;                                  // 0x07BC(0x0001) (Config, GlobalConfig)
	TEnumAsByte<EUTVehicleControls>                    VehicleControlType;                                       // 0x07BD(0x0001)
	unsigned char                                      UnknownData00[0x2];                                       // 0x07BE(0x0002) MISSED OFFSET
	struct FVector                                     DesiredLocation;                                          // 0x07C0(0x000C)
	class AUTAnnouncer*                                Announcer;                                                // 0x07CC(0x0004)
	class AUTMusicManager*                             MusicManager;                                             // 0x07D0(0x0004)
	float                                              LastTauntAnimTime;                                        // 0x07D4(0x0004)
	float                                              LastKickWarningTime;                                      // 0x07D8(0x0004)
	struct FString                                     MsgPlayerNotFound;                                        // 0x07DC(0x000C) (Const, Localized, NeedCtorLink)
	class UForceFeedbackWaveform*                      CameraShakeShortWaveForm;                                 // 0x07E8(0x0004)
	class UForceFeedbackWaveform*                      CameraShakeLongWaveForm;                                  // 0x07EC(0x0004)
	class UCameraAnim*                                 DamageCameraAnim;                                         // 0x07F0(0x0004)
	float                                              LastCameraTimeStamp;                                      // 0x07F4(0x0004)
	class UClass*                                      MatineeCameraClass;                                       // 0x07F8(0x0004)
	class AActor*                                      CalcViewActor;                                            // 0x07FC(0x0004)
	struct FVector                                     CalcViewActorLocation;                                    // 0x0800(0x000C)
	struct FRotator                                    CalcViewActorRotation;                                    // 0x080C(0x000C)
	struct FVector                                     CalcViewLocation;                                         // 0x0818(0x000C)
	struct FRotator                                    CalcViewRotation;                                         // 0x0824(0x000C)
	float                                              CalcEyeHeight;                                            // 0x0830(0x0004)
	struct FVector                                     CalcWalkBob;                                              // 0x0834(0x000C)
	float                                              LastWarningTime;                                          // 0x0840(0x0004)
	float                                              FOVLinearZoomRate;                                        // 0x0844(0x0004)
	float                                              FOVNonlinearZoomInterpSpeed;                              // 0x0848(0x0004) (Transient)
	float                                              ZoomRotationModifier;                                     // 0x084C(0x0004)
	struct FRotator                                    DebugFreeCamRot;                                          // 0x0850(0x000C) (Transient)
	float                                              LastShowPathTime;                                         // 0x085C(0x0004)
	class AActor*                                      LastAutoObjective;                                        // 0x0860(0x0004)
	float                                              LastBullseyeTime;                                         // 0x0864(0x0004)
	float                                              LastUseTime;                                              // 0x0868(0x0004)
	float                                              OldMessageTime;                                           // 0x086C(0x0004)
	float                                              LastFriendlyFireTime;                                     // 0x0870(0x0004)
	class UUTUIDataStore_StringAliasBindingsMap*       BoundEventsStringDataStore;                               // 0x0874(0x0004)
	float                                              NextAdminCmdTime;                                         // 0x0878(0x0004)
	float                                              OnFootDefaultFOV;                                         // 0x087C(0x0004) (Config, GlobalConfig)
	float                                              LastIncomingMessageTime;                                  // 0x0880(0x0004)
	float                                              LastCombatUpdateTime;                                     // 0x0884(0x0004)
	float                                              LastTeamChangeTime;                                       // 0x0888(0x0004)
	class UClass*                                      AchievementHandlerClass;                                  // 0x088C(0x0004)
	class UUTAchievementsBase*                         AchievementHandler;                                       // 0x0890(0x0004) (Transient)
	class UUTLeaderboardRead*                          LeaderboardStatsRead;                                     // 0x0894(0x0004)
	class UClass*                                      LeaderboardStatsWriteClass;                               // 0x0898(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UTGame.UTPlayerController");
		return ptr;
	}


	void ReadLeaderboardStatsComplete(bool bWasSuccessful);
	void ClientWriteLeaderboardStats(class UClass* OnlineStatsWriteClass, bool bIsIncomplete);
	void ClientUpdateSpiceOfLife(int MutatorBitMask);
	void ClientUpdateAchievement(int AchievementId, int Count);
	void InitAchievementHandler();
	void Disconnect();
	void ServerForceTextUnMute(const struct FString& TargetPlayer);
	void AdminForceTextUnMute(const struct FString& TargetPlayer);
	void ServerForceTextMute(const struct FString& TargetPlayer);
	void AdminForceTextMute(const struct FString& TargetPlayer);
	void ServerForceVoiceUnMute(const struct FString& TargetPlayer);
	void AdminForceVoiceUnMute(const struct FString& TargetPlayer);
	void ServerForceVoiceMute(const struct FString& TargetPlayer);
	void AdminForceVoiceMute(const struct FString& TargetPlayer);
	void ServerChangeMap(const struct FString& URL);
	void AdminChangeMap(const struct FString& URL);
	void ServerRestartMap();
	void AdminRestartMap();
	void AdminPlayerList();
	void AdminKick(const struct FString& S);
	void AdminKickBan(const struct FString& S);
	void ServerAdmin(const struct FString& CommandLine);
	void Admin(const struct FString& CommandLine);
	void ServerAdminLogOut();
	void AdminLogout();
	void ServerAdminLogin(const struct FString& Password);
	void AdminLogin(const struct FString& Password);
	bool AdminCmdOk();
	void ServerTeamSay(const struct FString& msg);
	void ServerSay(const struct FString& msg);
	void ServerKickBan(const struct FString& PlayerToKick, bool bBan);
	void GetSeamlessTravelActorList(bool bToEntry, TArray<class AActor*>* ActorList);
	void ServerChangeTeam(int N);
	void BullseyeMessage();
	void ServerSetNetSpeed(int NewSpeed);
	void ReceiveBotVoiceMessage(class AUTPlayerReplicationInfo* SenderPRI, int MessageIndex, class UObject* LocationObject);
	void SendMessage(class APlayerReplicationInfo* Recipient, const struct FName& MessageType, float Wait, class UClass* DamageType);
	bool CanRestartPlayer();
	void CharacterProcessingComplete();
	void GetPlayerLoc();
	void UpdateRotation(float DeltaTime);
	void ClientEndZoom();
	void EndZoomNonlinear(float ZoomInterpSpeed);
	void EndZoom();
	void StopZoom();
	void StartZoomNonlinear(float NewDesiredFOV, float NewZoomInterpSpeed);
	void StartZoom(float NewDesiredFOV, float NewZoomRate);
	void AdjustFOV(float DeltaTime);
	void OnUpdatePropertyFOVAngle();
	void FlushDebug();
	void ClientBecameActivePlayer();
	void ServerBecomeActivePlayer();
	void BecomeActive();
	void ServerShowPathToBase(unsigned char TeamNum);
	void BasePath(unsigned char Num);
	void ClientPawnDied();
	void PawnDied(class APawn* P);
	void CheckBulletWhip(class USoundCue* BulletWhip, const struct FVector& FireLocation, const struct FVector& FireDir, const struct FVector& HitLocation);
	void ClientRoundEnded(class AActor* EndRoundFocus);
	void RoundHasEnded(class AActor* EndRoundFocus);
	void ClientGameEnded(class AActor* EndGameFocus, bool bIsWinner);
	void ShowMidGameMenu(const struct FName& TabTag, bool bEnableInput);
	void ShowMap();
	void AdjustCameraScale(bool bIn);
	void NextWeapon();
	void PrevWeapon();
	void ServerViewObjective();
	void ViewObjective();
	void ServerViewPlayerByName(const struct FString& PlayerName);
	void ViewPlayerByName(const struct FString& PlayerName);
	void ServerViewSelf(const struct FViewTargetTransitionParams& TransitionParams);
	void SwitchWeapon(unsigned char T);
	void ViewNextBot();
	void LongClientAdjustPosition(float TimeStamp, const struct FName& NewState, TEnumAsByte<EPhysics> newPhysics, float NewLocX, float NewLocY, float NewLocZ, float NewVelX, float NewVelY, float NewVelZ, class AActor* NewBase, float NewFloorX, float NewFloorY, float NewFloorZ);
	void ShortServerMove(float TimeStamp, const struct FVector& ClientLoc, unsigned char NewFlags, unsigned char ClientRoll, int View);
	void CallServerMove(class USavedMove* NewMove, const struct FVector& ClientLoc, unsigned char ClientRoll, int View, class USavedMove* OldMove);
	void ToggleTranslocator();
	void ToggleMelee();
	void ViewShake(float DeltaTime);
	void OnStopCameraAnim(class UUTSeqAct_StopCameraAnim* inAction);
	void OnPlayCameraAnim(class UUTSeqAct_PlayCameraAnim* inAction);
	void ClientStopCameraAnim(class UCameraAnim* AnimToStop);
	void ClientPlayCameraAnim(class UCameraAnim* AnimToPlay, float Scale, float Rate, float BlendInTime, float BlendOutTime, bool bLoop, bool bRandomStartTime, TEnumAsByte<ECameraAnimPlaySpace> Space, const struct FRotator& CustomPlaySpace);
	void SetCameraAnimStrength(float NewStrength);
	void StopCameraAnim(bool bImmediate);
	void PlayCameraAnim(class UCameraAnim* AnimToPlay, float Scale, float Rate, float BlendInTime, float BlendOutTime, bool bLoop, bool bIsDamageShake);
	void StopViewShaking();
	void DamageShake(int Damage, class UClass* DamageType);
	void PlayAnnouncement(class UClass* InMessageClass, int MessageIndex, class APlayerReplicationInfo* PRI, class UObject* OptionalObject);
	void ClientPlayAnnouncement(class UClass* InMessageClass, int MessageIndex, class APlayerReplicationInfo* PRI, class UObject* OptionalObject);
	void Music(int EventIndex);
	bool AlreadyInActionMusic();
	void ClientMusicEvent(int EventIndex);
	void GetPlayerViewPoint(struct FVector* POVLocation, struct FRotator* POVRotation);
	void SpawnCamera();
	void SetCameraMode(const struct FName& NewCamMode);
	void ClientSetBehindView(bool bNewBehindView);
	void SetBehindView(bool bNewBehindView);
	void BehindView();
	void ClientReset();
	void Reset();
	void DisplayDebug(class AHUD* HUD, float* out_YL, float* out_YPos);
	void ShowScoreboard();
	void ServerSpectate();
	void ClearDoubleClick();
	bool PerformedUseAction();
	void Use();
	void ServerUse();
	void ClientPlayTakeHit(const struct FVector& HitLoc, unsigned char Damage, class UClass* DamageType);
	void NotifyTakeHit(class AController* InstigatedBy, const struct FVector& HitLocation, int Damage, class UClass* DamageType, const struct FVector& Momentum);
	void PlayStartupMessage(unsigned char StartupStage);
	void ToggleScreenShotMode();
	void SetAutoTaunt(bool Value);
	void ServerSetAutoTaunt(bool Value);
	bool UsingFirstPersonCamera();
	void ResetCameraMode();
	void SetHand(TEnumAsByte<EWeaponHand> NewWeaponHand);
	void ServerSetHand(TEnumAsByte<EWeaponHand> NewWeaponHand);
	void ServerPlayerPreferences(TEnumAsByte<EWeaponHand> NewWeaponHand, bool bNewAutoTaunt, bool bNewCenteredWeaponFire, TEnumAsByte<EAutoObjectivePreference> NewAutoObjectivePreference, TEnumAsByte<EUTVehicleControls> NewVehicleControls);
	void ReceivedPlayer();
	void AcknowledgePossession(class APawn* P);
	void Possess(class APawn* inPawn, bool bVehicleTransition);
	void ClientSetAutoObjective(class AActor* NewAutoObjective);
	void SetAutoObjective(class AActor* ObjectiveActor, bool bOnlyNotifyDifferent);
	void CheckAutoObjective(bool bOnlyNotifyDifferent);
	void SetViewTarget(class AActor* NewViewTarget, const struct FViewTargetTransitionParams& TransitionParams);
	void ClientRestart(class APawn* NewPawn);
	void Restart(bool bVehicleTransition);
	void FixFOV();
	void FOV(float F);
	void CheckJumpOrDuck();
	void KickWarning();
	void DrawHUD(class AHUD* H);
	void SoakPause(class APawn* P);
	void OnControllerChanged(int ControllerId, bool bIsConnected);
	void Destroyed();
	void Typing(bool bTyping);
	void Taunt(int TauntIndex);
	void ServerPlayVehicleHorn();
	void PlayVehicleHorn();
	bool TriggerInteracted();
	void PlayWinMessage(bool bWinner);
	void ProjectileWarningTimer();
	void ReceiveProjectileWarning(class AProjectile* Proj);
	void ReceiveWarning(class APawn* shooter, float projSpeed, const struct FVector& FireDir);
	void PlayBeepSound();
	bool LandingShake();
	void ServerDropFlag();
	void DropFlag();
	void ToggleMinimap();
	class AUTVehicle* CheckVehicleToDrive(bool bEnterVehicle);
	void ClientSetRequestedEntryWithFlag(class AUTVehicle* V, bool bNewValue, int MessageIndex);
	class AUTVehicle* CheckPickedVehicle(class AUTVehicle* V, bool bEnterVehicle);
	bool FindVehicleToDrive();
	struct FRotator GetAdjustedAimFor(class AWeapon* W, const struct FVector& StartFireLoc);
	float AimHelpModifier();
	bool AimingHelp(bool bInstantHit);
	void ClientHearSound(class USoundCue* ASound, class AActor* SourceActor, const struct FVector& SourceLocation, bool bStopWhenOwnerDestroyed, bool bIsOccluded);
	void ToggleSpeaking(bool bNowOn);
	void ServerProcessSpeechRecognition(const struct FSpeechRecognizedWord& ReplicatedWords);
	void SpeechRecognitionComplete();
	void ClientSetSpeechRecognitionObject(class USpeechRecognition* NewRecognitionData);
	void OnDestroyOnlineGameComplete(const struct FName& SessionName, bool bWasSuccessful);
	void OnEndOnlineGameComplete(const struct FName& SessionName, bool bWasSuccessful);
	bool CleanupOnlineSubsystemSession(bool bWasFromMenu);
	void FinishQuitToMainMenu();
	void QuitToMainMenu();
	void SetFrontEndErrorMessage(const struct FString& Title, const struct FString& Message);
	void ClientWasKicked();
	void NotifyNotEnoughSpaceInInvite();
	void NotifyNotAllPlayersCanJoinInvite();
	void NotifyInviteFailed();
	void OnFriendMessageReceived(unsigned char LocalUserNum, const struct FUniqueNetId& SendingPlayer, const struct FString& SendingNick, const struct FString& Message);
	void OnFriendInviteReceived(unsigned char LocalUserNum, const struct FUniqueNetId& RequestingPlayer, const struct FString& RequestingNick, const struct FString& Message);
	void OnGameInviteReceived(unsigned char LocalUserNum, const struct FString& RequestingNick);
	void OnReadProfileSettingsComplete(unsigned char LocalUserNum, bool bWasSuccessful);
	void OnLinkStatusChanged(bool bConnected);
	void OnConnectionStatusChange(TEnumAsByte<EOnlineServerConnectionStatus> ConnectionStatus);
	void ClientSetOnlineStatus();
	void ClearOnlineDelegates();
	void AddOnlineDelegates(bool bRegisterVoice);
	void UnregisterPlayerDataStores();
	void RegisterCustomPlayerDataStores();
	void ClearStringAliasBindingMapCache();
	void ServerSetCharacterClass(class UClass* CharClass);
	void PulseTeamColor();
	void InitInputSystem();
	void SwitchHud();
	void ServerThrowWeapon();
	void Camera(const struct FName& NewMode);
};


// Class UTGame.UTHUDBase
// 0x0068 (0x05F4 - 0x058C)
class AUTHUDBase : public AUDKHUD
{
public:
	class UGFxUIScoreboard*                            ScoreboardMovie;                                          // 0x058C(0x0004)
	class UGFxUI_PauseMenu*                            PauseMenuMovie;                                           // 0x0590(0x0004)
	class UClass*                                      MusicManagerClass;                                        // 0x0594(0x0004)
	class AUTPlayerController*                         UTPlayerOwner;                                            // 0x0598(0x0004)
	class AUTGameReplicationInfo*                      UTGRI;                                                    // 0x059C(0x0004)
	unsigned long                                      bIsSplitScreen : 1;                                       // 0x05A0(0x0004)
	unsigned long                                      bEnableActorOverlays : 1;                                 // 0x05A0(0x0004)
	unsigned long                                      bCrosshairShow : 1;                                       // 0x05A0(0x0004)
	unsigned long                                      bCrosshairOnFriendly : 1;                                 // 0x05A0(0x0004)
	unsigned long                                      bGreenCrosshair : 1;                                      // 0x05A0(0x0004)
	struct FTextureCoordinates                         ToolTipSepCoords;                                         // 0x05A4(0x0010)
	float                                              LastTimeTooltipDrawn;                                     // 0x05B4(0x0004)
	class UTexture2D*                                  IconHudTexture;                                           // 0x05B8(0x0004) (Const)
	struct FString                                     ConsoleIconFontClassName;                                 // 0x05BC(0x000C) (Config, NeedCtorLink)
	float                                              ConfiguredCrosshairScaling;                               // 0x05C8(0x0004)
	float                                              LastPickupTime;                                           // 0x05CC(0x0004)
	struct FColor                                      BlackColor;                                               // 0x05D0(0x0004) (Const)
	struct FColor                                      GoldColor;                                                // 0x05D4(0x0004) (Const)
	struct FColor                                      LightGoldColor;                                           // 0x05D8(0x0004) (Const)
	struct FColor                                      LightGreenColor;                                          // 0x05DC(0x0004) (Const)
	float                                              ResolutionScale;                                          // 0x05E0(0x0004)
	float                                              ResolutionScaleX;                                         // 0x05E4(0x0004)
	int                                                ViewX;                                                    // 0x05E8(0x0004)
	int                                                ViewY;                                                    // 0x05EC(0x0004)
	class UGFxUILeaderboard*                           LeaderboardMovie;                                         // 0x05F0(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UTGame.UTHUDBase");
		return ptr;
	}


	void DrawShadowedRotatedTile(class UTexture2D* Tex, const struct FRotator& Rot, float X, float Y, float XL, float YL, float U, float V, float UL, float VL, const struct FColor& TileColor, bool bScaleToRes);
	void DrawShadowedStretchedTile(class UTexture2D* Tex, float X, float Y, float XL, float YL, float U, float V, float UL, float VL, const struct FColor& TileColor, bool bScaleToRes);
	void DrawShadowedTile(class UTexture2D* Tex, float X, float Y, float XL, float YL, float U, float V, float UL, float VL, const struct FColor& TileColor, bool bScaleToRes);
	bool CheckCrosshairOnFriendly();
	void DrawToolTip(class UCanvas* Cvs, class APlayerController* PC, const struct FString& Command, float X, float Y, float U, float V, float UL, float VL, float ResScale, class UTexture2D* IconTexture, float Alpha);
	void SetShowLeaderboard(bool bEnableLeaderboard);
	void ToggleLeaderboard();
	void SetShowScores(bool bEnableShowScores);
	int GetLocalPlayerOwnerIndex();
	void ReleaseShowScores();
	void CompletePauseMenuClose();
	void TogglePauseMenu();
	void CloseOtherMenus();
	void SetVisible(bool bNewVisible);
	void RemoveMovies();
	void OnOpenAnimComplete();
	void OnCloseAnimComplete();
	void PostRender();
	void ResolutionChanged();
	void ShowMenu();
	void Timer();
	void PostBeginPlay();
};


// Class UTGame.UTGFxHudWrapper
// 0x000C (0x0600 - 0x05F4)
class AUTGFxHudWrapper : public AUTHUDBase
{
public:
	class UGFxMinimapHud*                              HudMovie;                                                 // 0x05F4(0x0004)
	class UGFxProjectedUI*                             InventoryMovie;                                           // 0x05F8(0x0004)
	class UClass*                                      MinimapHUDClass;                                          // 0x05FC(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UTGame.UTGFxHudWrapper");
		return ptr;
	}


	void CompleteCloseTimer();
	void CompleteCloseInventory();
	void ToggleInventory();
	void AddConsoleMessage(const struct FString& M, class UClass* InMessageClass, class APlayerReplicationInfo* PRI, float Lifetime);
	void LocalizedMessage(class UClass* InMessageClass, class APlayerReplicationInfo* RelatedPRI_2, class APlayerReplicationInfo* RelatedPRI_3, const struct FString& CriticalString, int Switch, float Position, float Lifetime, int FontSize, const struct FColor& DrawColor, class UObject* OptionalObject);
	void DrawHUD();
	void PostRender();
	void ResolutionChanged();
	void CloseOtherMenus();
	void DisplayHit(const struct FVector& HitDir, int Damage, class UClass* DamageType);
	void SetVisible(bool bNewVisible);
	int GetLocalPlayerOwnerIndex();
	void CreateHUDMovie();
	void PostBeginPlay();
	void RemoveMovies();
	void Destroyed();
	void MinimapZoomOut();
	void MinimapZoomIn();
};


// Class UTGame.UTGFxTeamHUDWrapper
// 0x0000 (0x0600 - 0x0600)
class AUTGFxTeamHUDWrapper : public AUTGFxHudWrapper
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UTGame.UTGFxTeamHUDWrapper");
		return ptr;
	}


	void Timer();
};


// Class UTGame.UTPlayerReplicationInfo
// 0x00F9 (0x037D - 0x0284)
class AUTPlayerReplicationInfo : public APlayerReplicationInfo
{
public:
	unsigned long                                      bHasFlag : 1;                                             // 0x0284(0x0004) (Net)
	unsigned long                                      bHolding : 1;                                             // 0x0284(0x0004) (Net)
	unsigned long                                      bIsFemale : 1;                                            // 0x0284(0x0004) (Net)
	int                                                spree;                                                    // 0x0288(0x0004)
	int                                                MultiKillLevel;                                           // 0x028C(0x0004)
	float                                              LastKillTime;                                             // 0x0290(0x0004)
	class AUTSquadAI*                                  Squad;                                                    // 0x0294(0x0004) (Net)
	class AUTCarriedObject*                            HasFlag;                                                  // 0x0298(0x0004)
	class UClass*                                      VoiceClass;                                               // 0x029C(0x0004)
	class AUTPlayerReplicationInfo*                    LastKillerPRI;                                            // 0x02A0(0x0004)
	struct FColor                                      DefaultHudColor;                                          // 0x02A4(0x0004)
	struct FVector                                     HUDLocation;                                              // 0x02A8(0x000C)
	class UClass*                                      CharClassInfo;                                            // 0x02B4(0x0004) (Net, RepNotify)
	class UTexture*                                    CharPortrait;                                             // 0x02B8(0x0004)
	TArray<struct FIntStat>                            KillStats;                                                // 0x02BC(0x000C) (NeedCtorLink)
	TArray<struct FIntStat>                            DeathStats;                                               // 0x02C8(0x000C) (NeedCtorLink)
	TArray<struct FIntStat>                            SuicideStats;                                             // 0x02D4(0x000C) (NeedCtorLink)
	TArray<struct FIntStat>                            EventStats;                                               // 0x02E0(0x000C) (NeedCtorLink)
	TArray<struct FIntStat>                            VehicleKillStats;                                         // 0x02EC(0x000C) (NeedCtorLink)
	TArray<struct FIntStat>                            PickupStats;                                              // 0x02F8(0x000C) (NeedCtorLink)
	TArray<struct FTimeStat>                           DrivingStats;                                             // 0x0304(0x000C) (NeedCtorLink)
	TArray<struct FTimeStat>                           PowerupTimeStats;                                         // 0x0310(0x000C) (NeedCtorLink)
	struct FString                                     OrdersString[0x8];                                        // 0x031C(0x000C) (Const, Localized, NeedCtorLink)
	unsigned char                                      OrdersIndex;                                              // 0x037C(0x0001) (Net)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UTGame.UTPlayerReplicationInfo");
		return ptr;
	}


	void UpdatePowerupAchievements(const struct FName& StatName, int Time);
	void UpdateEventStatAchievements(const struct FName& StatName);
	bool AttemptMidGameMenu();
	void ShowMidGameMenu(bool bInitial);
	void ReplicatedEvent(const struct FName& VarName);
	void ServerTeleportToActor(class AActor* DestinationActor);
	bool AllowClientToTeleport(class AActor* DestinationActor, class AUTPawn** OwnerPawn);
	void SeamlessTravelTo(class APlayerReplicationInfo* NewPRI);
	void CopyProperties(class APlayerReplicationInfo* PRI);
	void OverrideWith(class APlayerReplicationInfo* PRI);
	struct FString GetCallSign();
	void Reset();
	void IncrementKills(bool bEnemyKill);
	class AUTCarriedObject* GetFlag();
	void SetFlag(class AUTCarriedObject* NewFlag);
	void StopPowerupTimeStat(const struct FName& NewStatName);
	void StartPowerupTimeStat(const struct FName& NewStatName);
	int IncrementPickupStat(const struct FName& NewStatName);
	int IncrementVehicleKillStat(const struct FName& NewStatName);
	void StopDrivingStat(const struct FName& NewStatName);
	void StartDrivingStat(const struct FName& NewStatName);
	int IncrementEventStat(const struct FName& NewStatName);
	int IncrementSuicideStat(const struct FName& NewStatName);
	int IncrementDeathStat(const struct FName& NewStatName);
	int IncrementKillStat(const struct FName& NewStatName);
	bool ShouldBroadCastWelcomeMessage(bool bExiting);
	bool IsLocalPlayerPRI();
};


// Class UTGame.UTCharInfo
// 0x0024 (0x0060 - 0x003C)
class UUTCharInfo : public UObject
{
public:
	TArray<struct FCharacterInfo>                      Characters;                                               // 0x003C(0x000C) (Edit, Config, NeedCtorLink)
	TArray<class UClass*>                              Families;                                                 // 0x0048(0x000C) (Edit, NeedCtorLink)
	float                                              LOD1DisplayFactor;                                        // 0x0054(0x0004) (Edit, Config)
	float                                              LOD2DisplayFactor;                                        // 0x0058(0x0004) (Edit, Config)
	float                                              LOD3DisplayFactor;                                        // 0x005C(0x0004) (Edit, Config)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UTGame.UTCharInfo");
		return ptr;
	}


	struct FString GetRandomCharClassName();
	class UClass* FindFamilyInfo(const struct FString& InFamilyID);
};


// Class UTGame.UTTeamInfo
// 0x005C (0x024C - 0x01F0)
class AUTTeamInfo : public ATeamInfo
{
public:
	int                                                DesiredTeamSize;                                          // 0x01F0(0x0004)
	class AUTTeamAI*                                   AI;                                                       // 0x01F4(0x0004)
	class AUTGameObjective*                            HomeBase;                                                 // 0x01F8(0x0004) (Net)
	class AUTCarriedObject*                            TeamFlag;                                                 // 0x01FC(0x0004) (Net)
	struct FString                                     Faction;                                                  // 0x0200(0x000C) (NeedCtorLink)
	struct FColor                                      BaseTeamColor[0x4];                                       // 0x020C(0x0004)
	struct FString                                     TeamColorNames[0x4];                                      // 0x021C(0x000C) (Const, Localized, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UTGame.UTTeamInfo");
		return ptr;
	}


	void Destroyed();
	struct FCharacterInfo GetBotInfo(const struct FString& BotName);
	void GetAvailableBotList(const struct FString& FactionFilter, bool bMalesOnly, TArray<int>* AvailableBots);
	bool BotNameTaken(const struct FString& BotName);
	void RemoveFromTeam(class AController* Other);
	void SetBotOrders(class AUTBot* NewBot);
	bool NeedsBotMoreThan(class AUTTeamInfo* T);
	void Initialize(int NewTeamIndex);
	bool AllBotsSpawned();
	void Reset();
	struct FColor GetHUDColor();
	struct FString GetHumanReadableName();
};


// Class UTGame.UTPawn
// 0x024C (0x087C - 0x0630)
class AUTPawn : public AUDKPawn
{
public:
	unsigned long                                      bFixedView : 1;                                           // 0x0630(0x0004)
	unsigned long                                      bSpawnDone : 1;                                           // 0x0630(0x0004)
	unsigned long                                      bSpawnIn : 1;                                             // 0x0630(0x0004)
	unsigned long                                      bShieldAbsorb : 1;                                        // 0x0630(0x0004)
	unsigned long                                      bDodging : 1;                                             // 0x0630(0x0004)
	unsigned long                                      bStopOnDoubleLanding : 1;                                 // 0x0630(0x0004)
	unsigned long                                      bIsInvulnerable : 1;                                      // 0x0630(0x0004)
	unsigned long                                      bJustDroppedOrb : 1;                                      // 0x0630(0x0004)
	unsigned long                                      bForcedFeignDeath : 1;                                    // 0x0630(0x0004)
	unsigned long                                      bWeaponBob : 1;                                           // 0x0630(0x0004) (Config, GlobalConfig)
	unsigned long                                      bJustLanded : 1;                                          // 0x0630(0x0004)
	unsigned long                                      bLandRecovery : 1;                                        // 0x0630(0x0004)
	unsigned long                                      bHasHoverboard : 1;                                       // 0x0630(0x0004) (Net)
	unsigned long                                      bStopDeathCamera : 1;                                     // 0x0630(0x0004)
	unsigned long                                      bWinnerCam : 1;                                           // 0x0630(0x0004)
	unsigned long                                      bGibbed : 1;                                              // 0x0630(0x0004)
	unsigned long                                      bHeadGibbed : 1;                                          // 0x0630(0x0004)
	unsigned long                                      bArmsAttached : 1;                                        // 0x0630(0x0004)
	unsigned long                                      bWeaponAttachmentVisible : 1;                             // 0x0630(0x0004)
	unsigned long                                      bHideOnListenServer : 1;                                  // 0x0630(0x0004)
	unsigned long                                      bPostRenderTraceSucceeded : 1;                            // 0x0630(0x0004)
	unsigned long                                      bReceivedValidTeam : 1;                                   // 0x0630(0x0004)
	unsigned long                                      bKillsAffectHead : 1;                                     // 0x0630(0x0004)
	unsigned long                                      bKilledByBio : 1;                                         // 0x0630(0x0004)
	class UClass*                                      CurrentWeaponAttachmentClass;                             // 0x0634(0x0004) (Net, RepNotify)
	int                                                UnfeignFailedCount;                                       // 0x0638(0x0004)
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                         // 0x063C(0x0004) (ExportObject, Component, EditInline)
	class UAnimNodeBlend*                              FeignDeathBlend;                                          // 0x0640(0x0004)
	class UAnimNodeSlot*                               FullBodyAnimSlot;                                         // 0x0644(0x0004)
	class UAnimNodeSlot*                               TopHalfAnimSlot;                                          // 0x0648(0x0004)
	float                                              DeathHipLinSpring;                                        // 0x064C(0x0004) (Edit)
	float                                              DeathHipLinDamp;                                          // 0x0650(0x0004) (Edit)
	float                                              DeathHipAngSpring;                                        // 0x0654(0x0004) (Edit)
	float                                              DeathHipAngDamp;                                          // 0x0658(0x0004) (Edit)
	float                                              StartDeathAnimTime;                                       // 0x065C(0x0004)
	class UClass*                                      DeathAnimDamageType;                                      // 0x0660(0x0004)
	float                                              TimeLastTookDeathAnimDamage;                              // 0x0664(0x0004)
	struct FVector                                     FixedViewLoc;                                             // 0x0668(0x000C)
	struct FRotator                                    FixedViewRot;                                             // 0x0674(0x000C)
	float                                              CameraScale;                                              // 0x0680(0x0004)
	float                                              CurrentCameraScale;                                       // 0x0684(0x0004)
	float                                              CameraScaleMin;                                           // 0x0688(0x0004)
	float                                              CameraScaleMax;                                           // 0x068C(0x0004)
	struct FVector                                     OldCameraPosition;                                        // 0x0690(0x000C)
	float                                              CameraZOffset;                                            // 0x069C(0x0004)
	float                                              HeroCameraScale;                                          // 0x06A0(0x0004) (Edit)
	int                                                HeroCameraPitch;                                          // 0x06A4(0x0004) (Edit)
	float                                              DodgeSpeed;                                               // 0x06A8(0x0004)
	float                                              DodgeSpeedZ;                                              // 0x06AC(0x0004)
	TEnumAsByte<EDoubleClickDir>                       CurrentDir;                                               // 0x06B0(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x06B1(0x0003) MISSED OFFSET
	float                                              DoubleJumpEyeHeight;                                      // 0x06B4(0x0004) (Edit)
	float                                              DoubleJumpThreshold;                                      // 0x06B8(0x0004)
	float                                              DefaultAirControl;                                        // 0x06BC(0x0004)
	float                                              Bob;                                                      // 0x06C0(0x0004) (Config, GlobalConfig)
	float                                              LandBob;                                                  // 0x06C4(0x0004)
	float                                              JumpBob;                                                  // 0x06C8(0x0004)
	float                                              AppliedBob;                                               // 0x06CC(0x0004)
	float                                              bobtime;                                                  // 0x06D0(0x0004)
	struct FVector                                     WalkBob;                                                  // 0x06D4(0x000C)
	float                                              FeignDeathBodyAtRestSpeed;                                // 0x06E0(0x0004)
	float                                              FeignDeathStartTime;                                      // 0x06E4(0x0004)
	float                                              FeignDeathRecoveryStartTime;                              // 0x06E8(0x0004)
	int                                                SuperHealthMax;                                           // 0x06EC(0x0004)
	class UClass*                                      SoundGroupClass;                                          // 0x06F0(0x0004)
	class UClass*                                      CurrCharClassInfo;                                        // 0x06F4(0x0004)
	TArray<struct FName>                               TakeHitPhysicsFixedBones;                                 // 0x06F8(0x000C) (NeedCtorLink)
	TArray<struct FName>                               NoDriveBodies;                                            // 0x0704(0x000C) (NeedCtorLink)
	class UForceFeedbackWaveform*                      FallingDamageWaveForm;                                    // 0x0710(0x0004)
	float                                              AccumulateDamage;                                         // 0x0714(0x0004)
	float                                              AccumulationTime;                                         // 0x0718(0x0004)
	float                                              LastHoverboardTime;                                       // 0x071C(0x0004)
	float                                              MinHoverboardInterval;                                    // 0x0720(0x0004)
	class UUTAnimBlendByDriving*                       DrivingNode;                                              // 0x0724(0x0004)
	class UUTAnimBlendByVehicle*                       VehicleNode;                                              // 0x0728(0x0004)
	class UUTAnimBlendByHoverboarding*                 HoverboardingNode;                                        // 0x072C(0x0004)
	float                                              ShieldBeltArmor;                                          // 0x0730(0x0004) (Net)
	float                                              VestArmor;                                                // 0x0734(0x0004) (Net)
	float                                              ThighpadArmor;                                            // 0x0738(0x0004) (Net)
	class AUTWeaponAttachment*                         CurrentWeaponAttachment;                                  // 0x073C(0x0004)
	struct FName                                       WeaponSocket;                                             // 0x0740(0x0008)
	struct FName                                       WeaponSocket2;                                            // 0x0748(0x0008)
	struct FName                                       PawnEffectSockets[0x2];                                   // 0x0750(0x0008)
	float                                              HeadOffset;                                               // 0x0760(0x0004)
	float                                              HeadRadius;                                               // 0x0764(0x0004)
	float                                              HeadHeight;                                               // 0x0768(0x0004)
	struct FName                                       HeadBone;                                                 // 0x076C(0x0008)
	class UStaticMeshComponent*                        HeadshotNeckAttachment;                                   // 0x0774(0x0004) (ExportObject, Component, EditInline)
	class UClass*                                      TransInEffects[0x2];                                      // 0x0778(0x0004)
	struct FLinearColor                                TranslocateColor[0x2];                                    // 0x0780(0x0010)
	class UCameraAnim*                                 TransCameraAnim[0x3];                                     // 0x07A0(0x0004)
	class USoundCue*                                   ArmorHitSound;                                            // 0x07AC(0x0004)
	class USoundCue*                                   SpawnSound;                                               // 0x07B0(0x0004)
	class USoundCue*                                   TeleportSound;                                            // 0x07B4(0x0004)
	struct FLinearColor                                SpawnProtectionColor;                                     // 0x07B8(0x0010)
	float                                              TeamBeaconPlayerInfoMaxDist;                              // 0x07C8(0x0004) (Edit)
	class UTexture*                                    SpeakingBeaconTexture;                                    // 0x07CC(0x0004) (Edit)
	float                                              MapSize;                                                  // 0x07D0(0x0004)
	struct FTextureCoordinates                         IconCoords;                                               // 0x07D4(0x0010)
	float                                              LastPainSound;                                            // 0x07E4(0x0004)
	float                                              RagdollLifespan;                                          // 0x07E8(0x0004)
	class AUTProjectile*                               AttachedProj;                                             // 0x07EC(0x0004)
	float                                              MaxFootstepDistSq;                                        // 0x07F0(0x0004)
	float                                              MaxJumpSoundDistSq;                                       // 0x07F4(0x0004)
	class UClass*                                      HoverboardClass;                                          // 0x07F8(0x0004)
	struct FDrivenWeaponPawnInfo                       LastDrivenWeaponPawn;                                     // 0x07FC(0x000C)
	class AUTClientSideWeaponPawn*                     ClientSideWeaponPawn;                                     // 0x0808(0x0004)
	class UMaterialInterface*                          ShieldBeltMaterialInstance;                               // 0x080C(0x0004)
	class UMaterialInterface*                          ShieldBeltTeamMaterialInstances[0x4];                     // 0x0810(0x0004)
	int                                                JumpBootCharge;                                           // 0x0820(0x0004)
	float                                              DefaultMeshScale;                                         // 0x0824(0x0004)
	struct FName                                       TauntNames[0x6];                                          // 0x0828(0x0008)
	float                                              DesiredMeshScale;                                         // 0x0858(0x0004)
	struct FVector                                     CamOffset;                                                // 0x085C(0x000C)
	class UParticleSystemComponent*                    BioBurnAway;                                              // 0x0868(0x0004) (ExportObject, Component, EditInline)
	float                                              BioBurnAwayTime;                                          // 0x086C(0x0004)
	struct FName                                       BioEffectName;                                            // 0x0870(0x0008)
	float                                              DeathTime;                                                // 0x0878(0x0004)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UTGame.UTPawn");
		return ptr;
	}


	void HandDamp(float LinDamp);
	void HandSpring(float LinSpring);
	void BackDamp(float LinDamp);
	void BackSpring(float LinSpring);
	void PostBigTeleport();
	void PostTeleport(class ATeleporter* OutTeleporter);
	class UClass* GetFamilyInfo();
	bool NeedToTurn(const struct FVector& targ);
	void PossessedBy(class AController* C, bool bVehicleTransition);
	void OnInfiniteAmmo(class UUTSeqAct_InfiniteAmmo* Action);
	void OnExitVehicle(class UUTSeqAct_ExitVehicle* Action);
	void StuckFalling();
	void OnRanOver(class ASVehicle* Vehicle, class UPrimitiveComponent* RunOverComponent, int WheelIndex);
	void RigidBodyCollision(class UPrimitiveComponent* HitComponent, class UPrimitiveComponent* OtherComponent, int ContactIndex, struct FCollisionImpactData* RigidCollisionData);
	void TakeFallingDamage();
	void SetOverlayVisibility(bool bVisible);
	void TornOff();
	struct FRotator GetViewRotation();
	void AdjustCameraScale(bool bMoveCameraIn);
	bool IsFirstPerson();
	void ModifyRotForDebugFreeCam(struct FRotator* out_CamRot);
	bool IsLocationOnHead(float AdditionalScale, struct FImpactInfo* Impact);
	void TakeDrowningDamage();
	void SwitchWeapon(unsigned char NewGroup);
	void OnUseHoverboard(class UUTSeqAct_UseHoverboard* Action);
	void ServerHoverboard();
	void TakeHitBlendedOut();
	void PlayTakeHitEffects();
	void PlayHit(float Damage, class AController* InstigatedBy, const struct FVector& HitLocation, class UClass* DamageType, const struct FVector& Momentum, const struct FTraceHitInfo& HitInfo);
	void WeaponAttachmentChanged();
	void WeaponChanged(class AUTWeapon* NewWeapon);
	void WeaponStoppedFiring(class AWeapon* InWeapon, bool bViaReplication);
	void WeaponFired(class AWeapon* InWeapon, bool bViaReplication, const struct FVector& HitLocation);
	void TakeDamage(int Damage, class AController* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser);
	bool GetPuttingDownWeapon();
	void SetPuttingDownWeapon(bool bNowPuttingDownWeapon);
	void SetHeadScale(float NewScale);
	void ReplicatedEvent(const struct FName& VarName);
	void FireRateChanged();
	void SetBigHead();
	void FiringModeUpdated(class AWeapon* InWeapon, unsigned char InFiringMode, bool bViaReplication);
	void ForceRagdoll();
	void FeignDeath();
	void ServerFeignDeath();
	bool CheckValidLocation(const struct FVector& FeignLocation);
	bool SetFeignEndLocation(const struct FVector& HitLocation, const struct FVector& FeignLocation);
	void PlayFeignDeath();
	void FeignDeathDelayTimer();
	void StartFeignDeathRecoveryAnim();
	void ApplyWeaponOverlayFlags(unsigned char NewFlags);
	void ClearWeaponOverlayFlag(unsigned char FlagToClear);
	void SetWeaponOverlayFlag(unsigned char FlagToSet);
	class UMaterialInterface* GetOverlayMaterial();
	class UMaterialInterface* GetShieldMaterialInstance(bool bTeamGame);
	void SetOverlayMaterial(class UMaterialInterface* NewOverlay);
	class USoundCue* GetWeaponAmbientSound();
	void SetWeaponAmbientSound(class USoundCue* NewAmbientSound);
	class USoundCue* GetPawnAmbientSound();
	void SetPawnAmbientSound(class USoundCue* NewAmbientSound);
	void DisplayDebug(class AHUD* HUD, float* out_YL, float* out_YPos);
	void PlayDyingSound();
	bool CanMultiJump();
	bool CanDoubleJump();
	void JumpOutOfWater(const struct FVector& JumpDir);
	void Landed(const struct FVector& HitNormal, class AActor* FloorActor);
	bool DoJump(bool bUpdating);
	void StopFlying();
	void StartFlying();
	void Gasp();
	void DoDoubleJump(bool bUpdating);
	bool PerformDodge(TEnumAsByte<EDoubleClickDir> DoubleClickMove, const struct FVector& Dir, const struct FVector& Cross);
	struct FVector BotDodge(const struct FVector& Dir);
	bool Dodge(TEnumAsByte<EDoubleClickDir> DoubleClickMove);
	struct FVector GetWeaponStartTraceLocation(class AWeapon* CurrentWeapon);
	bool CalcThirdPersonCam(float fDeltaTime, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV);
	void SetHeroCam(struct FRotator* out_CamRot);
	bool TryNewCamRot(class AUTPlayerController* PC, const struct FRotator& ViewRotation, float* CamDist);
	void FindGoodEndView(class APlayerController* InPC, struct FRotator* GoodRotation);
	void SetThirdPersonCamera(bool bNewBehindView);
	bool CalcCamera(float fDeltaTime, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV);
	void AddDefaultInventory();
	void Destroyed();
	void DoingDeathAnim();
	void PlayDying(class UClass* DamageType, const struct FVector& HitLoc);
	void TurnOffPawn();
	void SpawnGibs(class UClass* UTDamageType, const struct FVector& HitLocation);
	class AUTGib* SpawnGib(class UClass* GibClass, const struct FName& BoneName, class UClass* UTDamageType, const struct FVector& HitLocation, bool bSpinGib);
	void SpawnHeadGib(class UClass* UTDamageType, const struct FVector& HitLocation);
	bool ShouldGib(class UClass* UTDamageType);
	void PlayJumpingSound();
	void PlayLandingSound();
	struct FName GetMaterialBelowFeet();
	void ActuallyPlayFootstepSound(int FootDown);
	void PlayFootStepSound(int FootDown);
	struct FString GetDebugName();
	bool GiveHealth(int HealAmount, int HealMax);
	void HoldGameObject(class AUDKCarriedObject* GameObj);
	void EnableInventoryPickup();
	void DropFlag();
	void AdjustDamage(class AController* InstigatedBy, const struct FVector& HitLocation, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser, int* InDamage, struct FVector* Momentum);
	int ShieldAbsorb(int Damage);
	int AbsorbDamage(int CurrentShieldStrength, float AbsorptionRate, int* Damage);
	int GetShieldStrength();
	void ClientRestart();
	void StopDriving(class AVehicle* V);
	void StartDriving(class AVehicle* V);
	void SpawnTransEffect(int TeamNum);
	void PlayTeleportEffect(bool bOut, bool bSound);
	void DeactivateSpawnProtection();
	void FixedView(const struct FString& VisibleMeshes);
	void SetMeshVisibility(bool bVisible);
	void SetWeaponAttachmentVisibility(bool bAttachmentVisible);
	void SetWeaponVisibility(bool bWeaponVisible);
	void EndViewTarget(class APlayerController* PC);
	void BecomeViewTarget(class APlayerController* PC);
	struct FVector GetPawnViewLocation();
	void UpdateEyeHeight(float DeltaTime);
	void FaceRotation(const struct FRotator& NewRotation, float DeltaTime);
	void PostRenderFor(class APlayerController* PC, class UCanvas* Canvas, const struct FVector& CameraPosition, const struct FVector& CameraDir);
	struct FString GetScreenName();
	void OnModifyHealth(class USeqAct_ModifyHealth* Action);
	void PlayVictoryAnimation();
	float GetEyeHeight();
	float RangedAttackTime();
	bool RecommendLongRangedAttack();
	unsigned char ChooseFireMode();
	bool StopWeaponFiring();
	bool BotFire(bool bFinished);
	bool StopFiring();
	void StartFire(unsigned char FireModeNum);
	bool Died(class AController* Killer, class UClass* DamageType, const struct FVector& HitLocation);
	void AddVelocity(const struct FVector& NewVelocity, const struct FVector& HitLocation, class UClass* DamageType, const struct FTraceHitInfo& HitInfo);
	void Falling();
	void StuckOnPawn(class APawn* OtherPawn);
	void JumpOffPawn();
	void gibbedBy(class AActor* Other);
	void EncroachedBy(class AActor* Other);
	bool EncroachingOn(class AActor* Other);
	void TurnOff();
	struct FVector WeaponBob(float BobDamping, float JumpDamping);
	void SpawnDefaultController();
	void OnPlayAnim(class UUTSeqAct_PlayAnim* inAction);
	void PlayEmote(const struct FName& InEmoteTag, int InPlayerID);
	void ServerPlayEmote(const struct FName& InEmoteTag, int InPlayerID);
	void DoPlayEmote(const struct FName& InEmoteTag, int InPlayerID);
	void PerformEmoteCommand(const struct FEmoteInfo& EInfo, int PlayerID);
	void LeaveABloodSplatterDecal(const struct FVector& HitLoc, const struct FVector& HitNorm);
	void SetWeapAnimType(TEnumAsByte<EWeapAnimType> AnimType);
	void SetAnimRateScale(float RateScale);
	void SetHandIKEnabled(bool bEnabled);
	void PostInitAnimTree(class USkeletalMeshComponent* SkelComp);
	void ReattachMesh();
	void UpdateShadowSettings(bool bWantShadow);
	void PostBeginPlay();
	void SetTeamColor();
	void SetFirstPersonArmsInfo(class USkeletalMesh* FirstPersonArmMesh, class UMaterialInterface* ArmMaterial);
	void NotifyTeamChanged();
	void ResetCharPhysState();
	void SetPawnRBChannels(bool bRagdollMode);
	void SetCharacterMeshInfo(class USkeletalMesh* SkelMesh, class UMaterialInterface* HeadMaterial, class UMaterialInterface* BodyMaterial);
	void SetCharacterClassFromInfo(class UClass* Info);
	bool VerifyBodyMaterialInstance();
	void SetArmsSkin(class UMaterialInterface* NewMaterial);
	void SetSkin(class UMaterial* NewMaterial);
	void SetInvisible(bool bNowInvisible);
	void SetBodyMatColor(const struct FLinearColor& NewBodyMatColor, float NewOverlayDuration);
	void ClearBodyMatColor();
	void SetWalking(bool bNewIsWalking);
	void RenderMapIcon(class UUTMapInfo* MP, class UCanvas* Canvas, class AUTPlayerController* PlayerOwner, const struct FLinearColor& FinalColor);
	bool InCombat();
	bool PoweredUp();
	void HeadVolumeChange(class APhysicsVolume* newHeadVolume);
	void FellOutOfWorld(class UClass* dmgType);
	class AUTPlayerReplicationInfo* GetUTPlayerReplicationInfo();
	float AdjustedStrength();
	void AdjustPPEffects(class AUTPlayerController* PC, bool bRemove);
};


// Class UTGame.UTFamilyInfo
// 0x0160 (0x019C - 0x003C)
class UUTFamilyInfo : public UObject
{
public:
	class UTexture*                                    DefaultHeadPortrait;                                      // 0x003C(0x0004)
	TArray<class UTexture*>                            DefaultTeamHeadPortrait;                                  // 0x0040(0x000C) (NeedCtorLink)
	struct FString                                     FamilyID;                                                 // 0x004C(0x000C) (NeedCtorLink)
