#pragma once

// Antichamber (1.0.7977.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class UnrealEd.ActorFactorySelection
// 0x0000 (0x0060 - 0x0060)
class UActorFactorySelection : public USelection
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ActorFactorySelection");
		return ptr;
	}

};


// Class UnrealEd.AITreeFactoryNew
// 0x0000 (0x0070 - 0x0070)
class UAITreeFactoryNew : public UFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AITreeFactoryNew");
		return ptr;
	}

};


// Class UnrealEd.AnalyzeContentCommandlet
// 0x0000 (0x007C - 0x007C)
class UAnalyzeContentCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnalyzeContentCommandlet");
		return ptr;
	}

};


// Class UnrealEd.AnalyzeCookedContentCommandlet
// 0x0018 (0x0094 - 0x007C)
class UAnalyzeCookedContentCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x007C(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnalyzeCookedContentCommandlet");
		return ptr;
	}

};


// Class UnrealEd.AnalyzeCookedPackagesCommandlet
// 0x0000 (0x007C - 0x007C)
class UAnalyzeCookedPackagesCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnalyzeCookedPackagesCommandlet");
		return ptr;
	}

};


// Class UnrealEd.AnalyzeCookedTextureSingleUsageCommandlet
// 0x00E0 (0x015C - 0x007C)
class UAnalyzeCookedTextureSingleUsageCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0xE0];                                      // 0x007C(0x00E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnalyzeCookedTextureSingleUsageCommandlet");
		return ptr;
	}

};


// Class UnrealEd.AnalyzeCookedTextureUsageCommandlet
// 0x0000 (0x007C - 0x007C)
class UAnalyzeCookedTextureUsageCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnalyzeCookedTextureUsageCommandlet");
		return ptr;
	}

};


// Class UnrealEd.AnalyzeKismetCommandlet
// 0x0040 (0x00BC - 0x007C)
class UAnalyzeKismetCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x007C(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnalyzeKismetCommandlet");
		return ptr;
	}

};


// Class UnrealEd.AnalyzeReferencedContentCommandlet
// 0x0568 (0x05E4 - 0x007C)
class UAnalyzeReferencedContentCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0x568];                                     // 0x007C(0x0568) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnalyzeReferencedContentCommandlet");
		return ptr;
	}

};


// Class UnrealEd.AnalyzeReferencedObjectCommandlet
// 0x0048 (0x00C4 - 0x007C)
class UAnalyzeReferencedObjectCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x007C(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnalyzeReferencedObjectCommandlet");
		return ptr;
	}

};


// Class UnrealEd.AnalyzeScriptCommandlet
// 0x0000 (0x007C - 0x007C)
class UAnalyzeScriptCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnalyzeScriptCommandlet");
		return ptr;
	}

};


// Class UnrealEd.AnalyzeShaderCachesCommandlet
// 0x0000 (0x007C - 0x007C)
class UAnalyzeShaderCachesCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnalyzeShaderCachesCommandlet");
		return ptr;
	}

};


// Class UnrealEd.AnimNodeEditInfo
// 0x0004 (0x0040 - 0x003C)
class UAnimNodeEditInfo : public UObject
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnimNodeEditInfo");
		return ptr;
	}

};


// Class UnrealEd.AnimNodeEditInfo_AimOffset
// 0x0008 (0x0048 - 0x0040)
class UAnimNodeEditInfo_AimOffset : public UAnimNodeEditInfo
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0040(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnimNodeEditInfo_AimOffset");
		return ptr;
	}

};


// Class UnrealEd.AnimSetFactoryNew
// 0x0000 (0x0070 - 0x0070)
class UAnimSetFactoryNew : public UFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnimSetFactoryNew");
		return ptr;
	}

};


// Class UnrealEd.AnimTreeEdSkelComponent
// 0x000B (0x05E0 - 0x05D5)
class UAnimTreeEdSkelComponent : public USkeletalMeshComponent
{
public:
	unsigned char                                      UnknownData00[0xB];                                       // 0x05D5(0x000B) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnimTreeEdSkelComponent");
		return ptr;
	}

};


// Class UnrealEd.AnimTreeFactoryNew
// 0x0000 (0x0070 - 0x0070)
class UAnimTreeFactoryNew : public UFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.AnimTreeFactoryNew");
		return ptr;
	}

};


// Class UnrealEd.ApexDestructibleDamageParametersFactoryNew
// 0x0000 (0x0070 - 0x0070)
class UApexDestructibleDamageParametersFactoryNew : public UFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ApexDestructibleDamageParametersFactoryNew");
		return ptr;
	}

};


// Class UnrealEd.ApexGenericAssetFactory
// 0x0000 (0x0070 - 0x0070)
class UApexGenericAssetFactory : public UFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ApexGenericAssetFactory");
		return ptr;
	}

};


// Class UnrealEd.ASVSkelComponent
// 0x002B (0x0600 - 0x05D5)
class UASVSkelComponent : public USkeletalMeshComponent
{
public:
	unsigned char                                      UnknownData00[0x2B];                                      // 0x05D5(0x002B) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ASVSkelComponent");
		return ptr;
	}

};


// Class UnrealEd.BatchExportCommandlet
// 0x0000 (0x007C - 0x007C)
class UBatchExportCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.BatchExportCommandlet");
		return ptr;
	}

};


// Class UnrealEd.BrowserManager
// 0x0024 (0x0060 - 0x003C)
class UBrowserManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x24];                                      // 0x003C(0x0024) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.BrowserManager");
		return ptr;
	}

};


// Class UnrealEd.BrushBuilder
// 0x003C (0x0078 - 0x003C)
class UBrushBuilder : public UObject
{
public:
	unsigned char                                      UnknownData00[0x3C];                                      // 0x003C(0x003C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.BrushBuilder");
		return ptr;
	}

};


// Class UnrealEd.CubeBuilder
// 0x001C (0x0094 - 0x0078)
class UCubeBuilder : public UBrushBuilder
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0078(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CubeBuilder");
		return ptr;
	}

};


// Class UnrealEd.ByteCodeSerializer
// 0x0044 (0x00D4 - 0x0090)
class UByteCodeSerializer : public UStruct
{
public:
	unsigned char                                      UnknownData00[0x44];                                      // 0x0090(0x0044) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ByteCodeSerializer");
		return ptr;
	}

};


// Class UnrealEd.CameraAnimFactory
// 0x0000 (0x0070 - 0x0070)
class UCameraAnimFactory : public UFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CameraAnimFactory");
		return ptr;
	}

};


// Class UnrealEd.CascadeConfiguration
// 0x0024 (0x0060 - 0x003C)
class UCascadeConfiguration : public UObject
{
public:
	unsigned char                                      UnknownData00[0x24];                                      // 0x003C(0x0024) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CascadeConfiguration");
		return ptr;
	}

};


// Class UnrealEd.CascadeOptions
// 0x00D0 (0x010C - 0x003C)
class UCascadeOptions : public UObject
{
public:
	unsigned char                                      UnknownData00[0xD0];                                      // 0x003C(0x00D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CascadeOptions");
		return ptr;
	}

};


// Class UnrealEd.CascadePreviewComponent
// 0x0008 (0x01E0 - 0x01D8)
class UCascadePreviewComponent : public UPrimitiveComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01D8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CascadePreviewComponent");
		return ptr;
	}

};


// Class UnrealEd.CheckLightMapUVsCommandlet
// 0x0000 (0x007C - 0x007C)
class UCheckLightMapUVsCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CheckLightMapUVsCommandlet");
		return ptr;
	}

};


// Class UnrealEd.CheckpointGameAssetDatabaseCommandlet
// 0x0000 (0x007C - 0x007C)
class UCheckpointGameAssetDatabaseCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CheckpointGameAssetDatabaseCommandlet");
		return ptr;
	}

};


// Class UnrealEd.ClassExporterUC
// 0x0000 (0x0064 - 0x0064)
class UClassExporterUC : public UExporter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ClassExporterUC");
		return ptr;
	}

};


// Class UnrealEd.ClassFactoryUC
// 0x0000 (0x0070 - 0x0070)
class UClassFactoryUC : public UFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ClassFactoryUC");
		return ptr;
	}

};


// Class UnrealEd.ColladaFactory
// 0x0004 (0x0074 - 0x0070)
class UColladaFactory : public UFactory
{
public:
	unsigned long                                      bImportAsSkeletalMesh : 1;                                // 0x0070(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ColladaFactory");
		return ptr;
	}

};


// Class UnrealEd.CompressAnimationsCommandlet
// 0x0000 (0x007C - 0x007C)
class UCompressAnimationsCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CompressAnimationsCommandlet");
		return ptr;
	}

};


// Class UnrealEd.ConformCommandlet
// 0x0000 (0x007C - 0x007C)
class UConformCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ConformCommandlet");
		return ptr;
	}

};


// Class UnrealEd.ContentAuditCommandlet
// 0x0000 (0x007C - 0x007C)
class UContentAuditCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ContentAuditCommandlet");
		return ptr;
	}

};


// Class UnrealEd.ContentComparisonCommandlet
// 0x00CC (0x0148 - 0x007C)
class UContentComparisonCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0xCC];                                      // 0x007C(0x00CC) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ContentComparisonCommandlet");
		return ptr;
	}

};


// Class UnrealEd.ConvertMapToNavMesh
// 0x0000 (0x007C - 0x007C)
class UConvertMapToNavMesh : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ConvertMapToNavMesh");
		return ptr;
	}

};


// Class UnrealEd.CookPackagesCommandlet
// 0x1488 (0x1504 - 0x007C)
class UCookPackagesCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0x1488];                                    // 0x007C(0x1488) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CookPackagesCommandlet");
		return ptr;
	}

};


// Class UnrealEd.CurveEdOptions
// 0x0078 (0x00B4 - 0x003C)
class UCurveEdOptions : public UObject
{
public:
	unsigned char                                      UnknownData00[0x78];                                      // 0x003C(0x0078) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CurveEdOptions");
		return ptr;
	}

};


// Class UnrealEd.CurveEdPresetBase
// 0x0000 (0x003C - 0x003C)
class UCurveEdPresetBase : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CurveEdPresetBase");
		return ptr;
	}

};


// Class UnrealEd.CurveEdPreset_CosWave
// 0x000C (0x0048 - 0x003C)
class UCurveEdPreset_CosWave : public UCurveEdPresetBase
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x003C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CurveEdPreset_CosWave");
		return ptr;
	}

};


// Class UnrealEd.CurveEdPreset_LinearDecay
// 0x0010 (0x004C - 0x003C)
class UCurveEdPreset_LinearDecay : public UCurveEdPresetBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x003C(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CurveEdPreset_LinearDecay");
		return ptr;
	}

};


// Class UnrealEd.CurveEdPreset_Nothing
// 0x0000 (0x003C - 0x003C)
class UCurveEdPreset_Nothing : public UCurveEdPresetBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CurveEdPreset_Nothing");
		return ptr;
	}

};


// Class UnrealEd.CurveEdPreset_SineWave
// 0x000C (0x0048 - 0x003C)
class UCurveEdPreset_SineWave : public UCurveEdPresetBase
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x003C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CurveEdPreset_SineWave");
		return ptr;
	}

};


// Class UnrealEd.CurveEdPreset_UserSet
// 0x0004 (0x0040 - 0x003C)
class UCurveEdPreset_UserSet : public UCurveEdPresetBase
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CurveEdPreset_UserSet");
		return ptr;
	}

};


// Class UnrealEd.CurveEdPresetCurveFactoryNew
// 0x0000 (0x0070 - 0x0070)
class UCurveEdPresetCurveFactoryNew : public UFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.CurveEdPresetCurveFactoryNew");
		return ptr;
	}

};


// Class UnrealEd.DecalMaterialFactoryNew
// 0x0000 (0x0070 - 0x0070)
class UDecalMaterialFactoryNew : public UFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.DecalMaterialFactoryNew");
		return ptr;
	}

};


// Class UnrealEd.DiffPackagesCommandlet
// 0x0018 (0x0094 - 0x007C)
class UDiffPackagesCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x007C(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.DiffPackagesCommandlet");
		return ptr;
	}

};


// Class UnrealEd.DumpEmittersCommandlet
// 0x0000 (0x007C - 0x007C)
class UDumpEmittersCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.DumpEmittersCommandlet");
		return ptr;
	}

};


// Class UnrealEd.DumpLightmapInfoCommandlet
// 0x0000 (0x007C - 0x007C)
class UDumpLightmapInfoCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.DumpLightmapInfoCommandlet");
		return ptr;
	}

};


// Class UnrealEd.DumpShadersCommandlet
// 0x000C (0x0088 - 0x007C)
class UDumpShadersCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x007C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.DumpShadersCommandlet");
		return ptr;
	}

};


// Class UnrealEd.EditorComponent
// 0x0028 (0x0200 - 0x01D8)
class UEditorComponent : public UPrimitiveComponent
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x01D8(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.EditorComponent");
		return ptr;
	}

};


// Class UnrealEd.EdModeComponent
// 0x0000 (0x0200 - 0x0200)
class UEdModeComponent : public UEditorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.EdModeComponent");
		return ptr;
	}

};


// Class UnrealEd.EditorEngine
// 0x0234 (0x0810 - 0x05DC)
class UEditorEngine : public UEngine
{
public:
	unsigned char                                      UnknownData00[0x234];                                     // 0x05DC(0x0234) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.EditorEngine");
		return ptr;
	}

};


// Class UnrealEd.UnrealEdEngine
// 0x0110 (0x0920 - 0x0810)
class UUnrealEdEngine : public UEditorEngine
{
public:
	unsigned char                                      UnknownData00[0x110];                                     // 0x0810(0x0110) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.UnrealEdEngine");
		return ptr;
	}

};


// Class UnrealEd.EditorPlayer
// 0x0000 (0x029C - 0x029C)
class UEditorPlayer : public ULocalPlayer
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.EditorPlayer");
		return ptr;
	}

};


// Class UnrealEd.EditorUserSettings
// 0x0018 (0x0054 - 0x003C)
class UEditorUserSettings : public UObject
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x003C(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.EditorUserSettings");
		return ptr;
	}

};


// Class UnrealEd.EditorViewportInput
// 0x0004 (0x00DC - 0x00D8)
class UEditorViewportInput : public UInput
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x00D8(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.EditorViewportInput");
		return ptr;
	}

};


// Class UnrealEd.ExamineOutersCommandlet
// 0x0000 (0x007C - 0x007C)
class UExamineOutersCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ExamineOutersCommandlet");
		return ptr;
	}

};


// Class UnrealEd.ExporterT3DX
// 0x0000 (0x0064 - 0x0064)
class UExporterT3DX : public UExporter
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ExporterT3DX");
		return ptr;
	}

};


// Class UnrealEd.MaterialExporterT3D
// 0x0000 (0x0064 - 0x0064)
class UMaterialExporterT3D : public UExporterT3DX
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.MaterialExporterT3D");
		return ptr;
	}

};


// Class UnrealEd.StaticMeshExporterT3D
// 0x0000 (0x0064 - 0x0064)
class UStaticMeshExporterT3D : public UExporterT3DX
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.StaticMeshExporterT3D");
		return ptr;
	}

};


// Class UnrealEd.TextureExporterT3D
// 0x0000 (0x0064 - 0x0064)
class UTextureExporterT3D : public UExporterT3DX
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.TextureExporterT3D");
		return ptr;
	}

};


// Class UnrealEd.ExportLocCommandlet
// 0x0000 (0x007C - 0x007C)
class UExportLocCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ExportLocCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FaceFXStudioSkelComponent
// 0x000B (0x05E0 - 0x05D5)
class UFaceFXStudioSkelComponent : public USkeletalMeshComponent
{
public:
	unsigned char                                      UnknownData00[0xB];                                       // 0x05D5(0x000B) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FaceFXStudioSkelComponent");
		return ptr;
	}

};


// Class UnrealEd.FbxFactory
// 0x0004 (0x0074 - 0x0070)
class UFbxFactory : public UFactory
{
public:
	class UFbxImportUI*                                Import_Options;                                           // 0x0070(0x0004) (Edit, Config, NoClear, EditInline)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FbxFactory");
		return ptr;
	}

};


// Class UnrealEd.FbxImportUI
// 0x0008 (0x0044 - 0x003C)
class UFbxImportUI : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x003C(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FbxImportUI");
		return ptr;
	}

};


// Class UnrealEd.ReimportFbxSkeletalMeshFactory
// 0x0004 (0x0078 - 0x0074)
class UReimportFbxSkeletalMeshFactory : public UFbxFactory
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0074(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ReimportFbxSkeletalMeshFactory");
		return ptr;
	}

};


// Class UnrealEd.TextureFactory
// 0x0054 (0x00C4 - 0x0070)
class UTextureFactory : public UFactory
{
public:
	unsigned long                                      NoCompression : 1;                                        // 0x0070(0x0004)
	unsigned long                                      UnknownData00 : 31;                                       // 0x0070(0x0001)
	unsigned long                                      CompressionNoAlpha : 1;                                   // 0x0074(0x0004) (Edit)
	unsigned long                                      UnknownData01 : 31;                                       // 0x0074(0x0001)
	unsigned long                                      DeferCompression : 1;                                     // 0x0078(0x0004) (Edit)
	TEnumAsByte<ETextureFactory_TextureCompressionSettings> CompressionSettings;                                      // 0x007C(0x0001) (Edit)
	unsigned char                                      UnknownData02[0x3];                                       // 0x007D(0x0003) MISSED OFFSET
	unsigned long                                      Create_Material_ : 1;                                     // 0x0080(0x0004) (Edit)
	unsigned long                                      UnknownData03 : 31;                                       // 0x0080(0x0001)
	unsigned long                                      RGB_To_Diffuse : 1;                                       // 0x0084(0x0004) (Edit)
	unsigned long                                      UnknownData04 : 31;                                       // 0x0084(0x0001)
	unsigned long                                      RGB_To_Emissive : 1;                                      // 0x0088(0x0004) (Edit)
	unsigned long                                      UnknownData05 : 31;                                       // 0x0088(0x0001)
	unsigned long                                      Alpha_To_Specular : 1;                                    // 0x008C(0x0004) (Edit)
	unsigned long                                      UnknownData06 : 31;                                       // 0x008C(0x0001)
	unsigned long                                      Alpha_To_Emissive : 1;                                    // 0x0090(0x0004) (Edit)
	unsigned long                                      UnknownData07 : 31;                                       // 0x0090(0x0001)
	unsigned long                                      Alpha_To_Opacity : 1;                                     // 0x0094(0x0004) (Edit)
	unsigned long                                      UnknownData08 : 31;                                       // 0x0094(0x0001)
	unsigned long                                      Alpha_To_Opacity_Mask : 1;                                // 0x0098(0x0004) (Edit)
	unsigned long                                      UnknownData09 : 31;                                       // 0x0098(0x0001)
	unsigned long                                      Two_Sided_ : 1;                                           // 0x009C(0x0004) (Edit)
	TEnumAsByte<ETextureFactory_Blending>              Blending;                                                 // 0x00A0(0x0001) (Edit)
	TEnumAsByte<ETextureFactory_LightingModel>         Lighting_Model;                                           // 0x00A1(0x0001) (Edit)
	TEnumAsByte<ELODGroup>                             LODGroup;                                                 // 0x00A2(0x0001) (Edit)
	unsigned char                                      UnknownData10[0x1];                                       // 0x00A3(0x0001) MISSED OFFSET
	unsigned long                                      FlipBook : 1;                                             // 0x00A4(0x0004) (Edit)
	unsigned long                                      UnknownData11 : 31;                                       // 0x00A4(0x0001)
	unsigned long                                      LightMap : 1;                                             // 0x00A8(0x0004) (Edit)
	unsigned long                                      UnknownData12 : 31;                                       // 0x00A8(0x0001)
	unsigned long                                      Dither_Mip_maps_alpha_ : 1;                               // 0x00AC(0x0004) (Edit)
	unsigned long                                      UnknownData13 : 31;                                       // 0x00AC(0x0001)
	unsigned long                                      Preserve_border_R : 1;                                    // 0x00B0(0x0004) (Edit)
	unsigned long                                      UnknownData14 : 31;                                       // 0x00B0(0x0001)
	unsigned long                                      Preserve_border_G : 1;                                    // 0x00B4(0x0004) (Edit)
	unsigned long                                      UnknownData15 : 31;                                       // 0x00B4(0x0001)
	unsigned long                                      Preserve_border_B : 1;                                    // 0x00B8(0x0004) (Edit)
	unsigned long                                      UnknownData16 : 31;                                       // 0x00B8(0x0001)
	unsigned long                                      Preserve_border_A : 1;                                    // 0x00BC(0x0004) (Edit)
	TEnumAsByte<ETextureFactory_TextureMipGenSettings> MipGenSettings;                                           // 0x00C0(0x0001) (Edit)
	unsigned char                                      UnknownData17[0x3];                                       // 0x00C1(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.TextureFactory");
		return ptr;
	}

};


// Class UnrealEd.ReimportTextureFactory
// 0x0008 (0x00CC - 0x00C4)
class UReimportTextureFactory : public UTextureFactory
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x00C4(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ReimportTextureFactory");
		return ptr;
	}

};


// Class UnrealEd.StaticMeshFactory
// 0x0018 (0x0088 - 0x0070)
class UStaticMeshFactory : public UFactory
{
public:
	int                                                Pitch;                                                    // 0x0070(0x0004)
	int                                                Roll;                                                     // 0x0074(0x0004)
	int                                                Yaw;                                                      // 0x0078(0x0004)
	unsigned long                                      bOneConvexPerUCXObject : 1;                               // 0x007C(0x0004) (Edit)
	unsigned long                                      UnknownData00 : 31;                                       // 0x007C(0x0001)
	unsigned long                                      bSingleSmoothGroupSingleTangent : 1;                      // 0x0080(0x0004) (Edit)
	unsigned long                                      UnknownData01 : 31;                                       // 0x0080(0x0001)
	unsigned long                                      bReplaceExistingVertexColors : 1;                         // 0x0084(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.StaticMeshFactory");
		return ptr;
	}

};


// Class UnrealEd.ReimportStaticMeshFactory
// 0x0004 (0x008C - 0x0088)
class UReimportStaticMeshFactory : public UStaticMeshFactory
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0088(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ReimportStaticMeshFactory");
		return ptr;
	}

};


// Class UnrealEd.ReimportFbxStaticMeshFactory
// 0x0004 (0x0078 - 0x0074)
class UReimportFbxStaticMeshFactory : public UFbxFactory
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0074(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ReimportFbxStaticMeshFactory");
		return ptr;
	}

};


// Class UnrealEd.SkeletalMeshFactory
// 0x0008 (0x0078 - 0x0070)
class USkeletalMeshFactory : public UFactory
{
public:
	unsigned long                                      bAssumeMayaCoordinates : 1;                               // 0x0070(0x0004) (Edit)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0074(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.SkeletalMeshFactory");
		return ptr;
	}

};


// Class UnrealEd.ReimportSkeletalMeshFactory
// 0x0004 (0x007C - 0x0078)
class UReimportSkeletalMeshFactory : public USkeletalMeshFactory
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0078(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ReimportSkeletalMeshFactory");
		return ptr;
	}

};


// Class UnrealEd.SoundFactory
// 0x0014 (0x0084 - 0x0070)
class USoundFactory : public UFactory
{
public:
	unsigned long                                      bAutoCreateCue : 1;                                       // 0x0070(0x0004) (Edit)
	unsigned long                                      UnknownData00 : 31;                                       // 0x0070(0x0001)
	unsigned long                                      bIncludeAttenuationNode : 1;                              // 0x0074(0x0004) (Edit)
	unsigned long                                      UnknownData01 : 31;                                       // 0x0074(0x0001)
	unsigned long                                      bIncludeLoopingNode : 1;                                  // 0x0078(0x0004) (Edit)
	unsigned long                                      UnknownData02 : 31;                                       // 0x0078(0x0001)
	unsigned long                                      bIncludeModulatorNode : 1;                                // 0x007C(0x0004) (Edit)
	float                                              CueVolume;                                                // 0x0080(0x0004) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.SoundFactory");
		return ptr;
	}

};


// Class UnrealEd.ReimportSoundFactory
// 0x0004 (0x0088 - 0x0084)
class UReimportSoundFactory : public USoundFactory
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0084(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.ReimportSoundFactory");
		return ptr;
	}

};


// Class UnrealEd.FindAssetReferencersCommandlet
// 0x0094 (0x0110 - 0x007C)
class UFindAssetReferencersCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0x94];                                      // 0x007C(0x0094) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FindAssetReferencersCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FindDarkDiffuseTexturesCommandlet
// 0x0050 (0x00CC - 0x007C)
class UFindDarkDiffuseTexturesCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x007C(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FindDarkDiffuseTexturesCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FindDuplicateKismetObjectsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFindDuplicateKismetObjectsCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FindDuplicateKismetObjectsCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FindDuplicateTexturesCommandlet
// 0x0118 (0x0194 - 0x007C)
class UFindDuplicateTexturesCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0x118];                                     // 0x007C(0x0118) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FindDuplicateTexturesCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FindEmitterMismatchedLODsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFindEmitterMismatchedLODsCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FindEmitterMismatchedLODsCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FindEmitterModifiedLODsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFindEmitterModifiedLODsCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FindEmitterModifiedLODsCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FindEmitterModuleLODErrorsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFindEmitterModuleLODErrorsCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FindEmitterModuleLODErrorsCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FindQuestionableTexturesCommandlet
// 0x0000 (0x007C - 0x007C)
class UFindQuestionableTexturesCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FindQuestionableTexturesCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FindStaticMeshCanBecomeDynamicCommandlet
// 0x0068 (0x00E4 - 0x007C)
class UFindStaticMeshCanBecomeDynamicCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0x68];                                      // 0x007C(0x0068) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FindStaticMeshCanBecomeDynamicCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FindStaticMeshEmptySectionsCommandlet
// 0x0080 (0x00FC - 0x007C)
class UFindStaticMeshEmptySectionsCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0x80];                                      // 0x007C(0x0080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FindStaticMeshEmptySectionsCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FindTexturesWithMissingPhysicalMaterialsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFindTexturesWithMissingPhysicalMaterialsCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FindTexturesWithMissingPhysicalMaterialsCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FindUniqueSpecularTextureMaterialsCommandlet
// 0x0048 (0x00C4 - 0x007C)
class UFindUniqueSpecularTextureMaterialsCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x007C(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FindUniqueSpecularTextureMaterialsCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FindUnreferencedFunctionsCommandlet
// 0x0004 (0x0080 - 0x007C)
class UFindUnreferencedFunctionsCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x007C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FindUnreferencedFunctionsCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FixAdditiveReferencesCommandlet
// 0x0000 (0x007C - 0x007C)
class UFixAdditiveReferencesCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FixAdditiveReferencesCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FixAmbiguousMaterialParametersCommandlet
// 0x0000 (0x007C - 0x007C)
class UFixAmbiguousMaterialParametersCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FixAmbiguousMaterialParametersCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FixupEmittersCommandlet
// 0x0000 (0x007C - 0x007C)
class UFixupEmittersCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FixupEmittersCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FixupRedirectsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFixupRedirectsCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FixupRedirectsCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FixupSourceUVsCommandlet
// 0x0000 (0x007C - 0x007C)
class UFixupSourceUVsCommandlet : public UCommandlet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FixupSourceUVsCommandlet");
		return ptr;
	}

};


// Class UnrealEd.FonixFactory
// 0x0000 (0x0070 - 0x0070)
class UFonixFactory : public UFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FonixFactory");
		return ptr;
	}

};


// Class UnrealEd.FractureMaterialFactoryNew
// 0x0000 (0x0070 - 0x0070)
class UFractureMaterialFactoryNew : public UFactory
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.FractureMaterialFactoryNew");
		return ptr;
	}

};


// Class UnrealEd.GameStatsDBUploader
// 0x0004 (0x005C - 0x0058)
class UGameStatsDBUploader : public UGameplayEventsHandler
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0058(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GameStatsDBUploader");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType
// 0x001C (0x0058 - 0x003C)
class UGenericBrowserType : public UObject
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x003C(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_AITree
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_AITree : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_AITree");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_Animation
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Animation : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_Animation");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_AnimTree
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_AnimTree : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_AnimTree");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_ApexClothingAsset
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_ApexClothingAsset : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_ApexClothingAsset");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_ApexDestructibleAsset
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_ApexDestructibleAsset : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_ApexDestructibleAsset");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_ApexDestructibleDamageParameters
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_ApexDestructibleDamageParameters : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_ApexDestructibleDamageParameters");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_ApexGenericAsset
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_ApexGenericAsset : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_ApexGenericAsset");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_Archetype
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Archetype : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_Archetype");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_CameraAnim
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_CameraAnim : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_CameraAnim");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_CurveEdPresetCurve
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_CurveEdPresetCurve : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_CurveEdPresetCurve");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_Custom
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Custom : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_Custom");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_All
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_All : public UGenericBrowserType_Custom
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_All");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_DecalMaterial
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_DecalMaterial : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_DecalMaterial");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_DMC
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_DMC : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_DMC");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_FaceFXAnimSet
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_FaceFXAnimSet : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_FaceFXAnimSet");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_FaceFXAsset
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_FaceFXAsset : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_FaceFXAsset");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_Font
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Font : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_Font");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_FractureMaterial
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_FractureMaterial : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_FractureMaterial");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_LensFlare
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_LensFlare : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_LensFlare");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_Material
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Material : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_Material");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_MaterialInstanceConstant
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_MaterialInstanceConstant : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_MaterialInstanceConstant");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_MaterialInstanceTimeVarying
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_MaterialInstanceTimeVarying : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_MaterialInstanceTimeVarying");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_MorphTargetSet
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_MorphTargetSet : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_MorphTargetSet");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_MorphWeightSequence
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_MorphWeightSequence : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_MorphWeightSequence");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_ParticleSystem
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_ParticleSystem : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_ParticleSystem");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_PhysicalMaterial
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_PhysicalMaterial : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_PhysicalMaterial");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_PhysicsAsset
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_PhysicsAsset : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_PhysicsAsset");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_PhysXParticleSystem
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_PhysXParticleSystem : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_PhysXParticleSystem");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_PostProcess
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_PostProcess : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_PostProcess");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_Prefab
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Prefab : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_Prefab");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_ProcBuildingRuleset
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_ProcBuildingRuleset : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_ProcBuildingRuleset");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_Sequence
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Sequence : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_Sequence");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_SkeletalMesh
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SkeletalMesh : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_SkeletalMesh");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_Sounds
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Sounds : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_Sounds");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_SoundClass
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SoundClass : public UGenericBrowserType_Sounds
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_SoundClass");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_SoundCue
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SoundCue : public UGenericBrowserType_Sounds
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_SoundCue");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_SoundMode
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SoundMode : public UGenericBrowserType_Sounds
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_SoundMode");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_SoundWave
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SoundWave : public UGenericBrowserType_Sounds
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_SoundWave");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_SpeechRecognition
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SpeechRecognition : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_SpeechRecognition");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_SpeedTree
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_SpeedTree : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_SpeedTree");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_StaticMesh
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_StaticMesh : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_StaticMesh");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_FracturedStaticMesh
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_FracturedStaticMesh : public UGenericBrowserType_StaticMesh
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_FracturedStaticMesh");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_TerrainLayer
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_TerrainLayer : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_TerrainLayer");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_TerrainMaterial
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_TerrainMaterial : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_TerrainMaterial");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_Texture
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_Texture : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_Texture");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_RenderTexture
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_RenderTexture : public UGenericBrowserType_Texture
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_RenderTexture");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_TextureCube
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_TextureCube : public UGenericBrowserType_Texture
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_TextureCube");
		return ptr;
	}

};


// Class UnrealEd.GenericBrowserType_TextureMovie
// 0x0000 (0x0058 - 0x0058)
class UGenericBrowserType_TextureMovie : public UGenericBrowserType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GenericBrowserType_TextureMovie");
		return ptr;
	}

};


// Class UnrealEd.GeomModifier
// 0x0014 (0x0050 - 0x003C)
class UGeomModifier : public UObject
{
public:
	unsigned char                                      UnknownData00[0x14];                                      // 0x003C(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GeomModifier");
		return ptr;
	}

};


// Class UnrealEd.GeomModifier_Edit
// 0x0000 (0x0050 - 0x0050)
class UGeomModifier_Edit : public UGeomModifier
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GeomModifier_Edit");
		return ptr;
	}

};


// Class UnrealEd.GeomModifier_Clip
// 0x001C (0x006C - 0x0050)
class UGeomModifier_Clip : public UGeomModifier_Edit
{
public:
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0050(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GeomModifier_Clip");
		return ptr;
	}

};


// Class UnrealEd.GeomModifier_Create
// 0x0000 (0x0050 - 0x0050)
class UGeomModifier_Create : public UGeomModifier_Edit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GeomModifier_Create");
		return ptr;
	}

};


// Class UnrealEd.GeomModifier_Delete
// 0x0000 (0x0050 - 0x0050)
class UGeomModifier_Delete : public UGeomModifier_Edit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GeomModifier_Delete");
		return ptr;
	}

};


// Class UnrealEd.GeomModifier_Extrude
// 0x000C (0x005C - 0x0050)
class UGeomModifier_Extrude : public UGeomModifier_Edit
{
public:
	unsigned char                                      UnknownData00[0xC];                                       // 0x0050(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GeomModifier_Extrude");
		return ptr;
	}

};


// Class UnrealEd.GeomModifier_Flip
// 0x0000 (0x0050 - 0x0050)
class UGeomModifier_Flip : public UGeomModifier_Edit
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GeomModifier_Flip");
		return ptr;
	}

};


// Class UnrealEd.GeomModifier_Lathe
// 0x0010 (0x0060 - 0x0050)
class UGeomModifier_Lathe : public UGeomModifier_Edit
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0050(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class UnrealEd.GeomModifier_Lathe");
		return ptr;
	}

};


// Class UnrealEd.GeomModifier_Optimize
// 0x0000 (0x0050 - 0x0050)
